[{"Serial":4044,"Award_Date":"11/29/2001","Description":"City of Cordele. The $250,000 would build a rail pur in Crisp County for a United Granite facility that would create 70 to 100 jobs. Corp investment of $10 million. Project Gray.","Status1":"Closed","Recipient_M":"City of Cordele Development Authority","Grant_Amt":250000,"Recaptured_Deob":250000,"Recaptured_Acct":null,"COUNTY":"Crisp","Type_4":"OneGeorgia","Beneficiaries":"United Granite","JobsPromised":70,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":10140000,"ActualPrivateInvestment":0,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"10/4/2002","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Requested $500,000 for Community Dev Block Grant. In Sept. 2002, Cordele requested Deobligation.; 50,000 each from Crisp County and City of Cordele and Crisp County Power for purchase of land;  City of Cordele. The $250,000 would build a rail pur in Crisp County for a United Granite facility that would create 70 to 100 jobs. Corp investment of $10 million. Project Gray."},{"Serial":4066,"Award_Date":"10/16/2001","Description":"Macon Bibb County Industrial Authority","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"King David Kosher Inc","JobsPromised":305,"JobsDelivered":201,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"check AJC archives: Company Failed Macon Economic Development Commission/Macon Bibb County Industrial Authority. Trying to locate King David Kosher Inc. at a former Cagle's plant in Macon. Funds to be used to buy equipment. Cagle's to offer financing to KDK to purchase building for $6.85 million at 6 percent interest for 7 years. $8 million private investment. CHECK AJC ARCHIVES: Competing with North Dakota for the STARTUP kosher food facility. KDK said would be cheaper to be in ND. Jobs starting at $7 to $9 per hour, plus managerial jobs. KDK promised 350 jobs. Equipment included 'kill line drip pans, foot perated lavatories for 6k and conveyors, blood traoughs 15k. May 2002, employed 201, including 11 rabbis and 179 hourly workers doing 25,000 birds a day. Had until Nov. 2002. Problems: trouble with kosher certification and 'majority of market would not use their product.' got an agreement for additonal certification, to get 70 percent of the market. Proposed restructure of debt. Late May 2002, KDK attempting to refinance, and apply for SBA loan with plans to start up agains with 85090 people. Received a new kosher desigation, STAR K, retooled the plant slightly. Of their total outstanding debt, $1.5 million, $1 million agreed to payment plan, $190k had an alternative plan, and $132k said no. Oct. 2002 negotations for a new contract to open plant back up. Plan to have 95 to 100 people. Jan. 2003, a new opportunity for KDK.  KDK negotiating to buy part of Empire Kosher and locate operations here. Deal falls through. March 03 KDK negotiating wth a Mexican kosher company. Company would be part of KDK and begin operations with 80 people. June 2003 KDK plans to file Chapter 7 bankruptcy. Pat Topping contacted by processor in PA interested in purchasing Macon Plant. Negotiations underway. Appears company went under and development authority compiled list of companies to sell $500,000 in equipment. Company only operated about six months before shut down. 'This has proved to be an unsuccessful project due to the company's closing.' Mexican processor Courson Poultry interested in buying and starting up to make chicken and chicken nuggest with Cagle's birds. County to dispose of equipment and market building. The former Cagle's plant had 1000 workers prior to Cagle's moving to Houston County.  Many of the 201 workers at KDK were ex Cagle's workers who had been on unemployment or welfare since closure. "},{"Serial":4068,"Award_Date":"01/15/2002","Description":"The Macon-Bibb County Industrial Authority proposes to use $270,000 in EDGE funds to pay for improvements to the Atlantic Southeast Airlines (ASA) maintenance facility at the Middle Georgia Regional Airport.  ASA is implementing a two-phase investment.  Phase I will entail the construction of a storage and training facility at the existing ASA maintenance facility.  Phase II will require either the construction of a new hangar or the enlargement of the existing hangar in order to establish an additional maintenance program for the new CRJ (Canadair Regional Jet).  The Edge Funds will pay for a portion of the construction cost of this training and storage building.  At least 300 jobs at the ASA facility will be retained with the continuation of existing operations, and Phase II is expected to generate an unspecified number of new jobs.  ","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":270000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"Atlantic Southeast Airlines","JobsPromised":300,"JobsDelivered":304,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Met jobs goal within time period. $1.1 million in private investment.  Macon-Bibb County Industrial Authority to pay for improvements to ASA maintenance facility at Middle Georgia Regional Airport. Two phases, construction of a storage and training facility. Constructoin of a new hangar or enlargement of existing hangar to establish a maintenance program for new CRJ jets. 300 jobs to be retained. An 'all or nothing deal' to keep the jobs or lose them. $270k in grant money and $1.26 million in money from local govt through refi of bonds to pay for the project. "},{"Serial":4070,"Award_Date":"02/05/2002","Description":"Liberty County Industrial Authority proposes to use $800,000 in EDGE funds to construct a 165,000 square foot warehouse/distribution facility costing $6,600,000.  The facility will be leased to Hugo Boss, who will install machinery and equipment with a value of $7,000,000 and employ 127 persons.","Status1":"Closed","Recipient_M":"Liberty County Industrial Development Authority","Grant_Amt":800000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Liberty","Type_4":"OneGeorgia","Beneficiaries":"Hugo Boss","JobsPromised":127,"JobsDelivered":50,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":13551917,"ActualPrivateInvestment":null,"LocalIncentives":1000000,"Public Funds Invested-Actual":null,"Closed Date":"5/30/2002","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Project closed May 2002 despite not enough jobs; 127 jobs were promised within 5 years. Did they deliver? Competition w/Hampton county SC. Final 2; Local is prop tax abatements"},{"Serial":4073,"Award_Date":"03/08/2002","Description":"Note - This award is tied to 01ge-047-3-4160 for administrative purposes.  The total amount awarded for this project was $1,000,000. All detail is in file 02ge-4073.  The Albany Dougherty Payroll Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE funds to pay for office equipment to serve CallTech Communications, LLC.  CallTech is establishing a new call center in the former WalMart building in Albany.  CallTech will employ 166 persons.  No private capital investment is anticipated at this time.    ","Status1":"Closed","Recipient_M":"Albany Dougherty Payroll Development Authority","Grant_Amt":1534465.90,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Dougherty","Type_4":"OneGeorgia","Beneficiaries":"*CallTech (2 grants)","JobsPromised":166,"JobsDelivered":240,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":1250000,"ActualPrivateInvestment":null,"LocalIncentives":275000,"Public Funds Invested-Actual":null,"Closed Date":"1/29/2003","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"No private investment/10 states competing/ 275,000 investment from city of albany and $229,589 from development authority"},{"Serial":4074,"Award_Date":"03/15/2002","Description":"The Crisp/Dooly Joint Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE funds to pay for leasehold improvements and equipment to serve Dayco Precision, Inc.  Dayco is establishing a new facility in the Small Business Development Center, an incubator in the Vienna Industrial Park in Dooly County.   Dayco will employ eight persons and make a capital investment of $400,000 in this new facility.  ","Status1":"Closed","Recipient_M":"Crisp/Dooly Joint Development Authority","Grant_Amt":32000,"Recaptured_Deob":null,"Recaptured_Acct":25825,"COUNTY":"Dooly","Type_4":"OneGeorgia","Beneficiaries":"Dayco","JobsPromised":8,"JobsDelivered":1,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":432000,"ActualPrivateInvestment":1600,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"4/3/2007","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"award expired March 2004. In August 2004 executive director of the Business Development Center said Dayco was renting space and had some small contracts 'but nothing as expected.' He advicesed to go ahead and initiate deobligation of funds; jobs were $6 to $14 an hour;  Dayco's principal has made multiple efforts to market gridnig fab and other services to business in Ga and the SE. He continues to see opportunities for work in exapnsion and  he has been succesfu in performing $2,000 in work under three small contracts for local and regioonal companies dring the grant period Crisp/Dooly Joint Development Authority. Dayco planned to put a new business in Vienna, Dooly County. Project to provide imporvements for the Small Business Development Center (incubator) at Vienna Industrial Park. For electrical upgrades to a facility"},{"Serial":4075,"Award_Date":"04/05/2002","Description":"The Sparta-Hancock County Development Authorityproposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE funds to partially fund construction of a new manufacturing facility for St. Gobain Desjonqueres (SGD) in Hancock County.  St. Gobain expects to make a private investment of $800,000 in machinery and equipment (M & E) and employ 80 persons initially, growing to a possible total of 200.  ","Status1":"Closed","Recipient_M":"Sparta-Hancock County Development Authority","Grant_Amt":2000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Hancock","Type_4":"OneGeorgia","Beneficiaries":"Saint Gobain","JobsPromised":80,"JobsDelivered":158,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":4884597,"ActualPrivateInvestment":null,"LocalIncentives":24000,"Public Funds Invested-Actual":null,"Closed Date":"4/3/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"makes high-end etched perfume bottles; Multiple awards in addition to OneGa.LAG of $1.4 m, GaDNR and Sandersville Tech $45,000 for landscaping and nature trail; local incentives is conytribution of land at no cost and planning assistance"},{"Serial":4087,"Award_Date":"04/16/2002","Description":"The City of Dublin and County of Laurens Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE grant money to fund site acquisition, site preparation, and equipment for a new distribution facility to be constructed for Fred's, Inc. in Laurens County.  Fred's expects to make a private investment of over $25 million in building construction and equipment and to employ 250 to 300 persons initially, growing to a possible total of 500.  ","Status1":"Closed","Recipient_M":"City of Dublin and County of Laurens Development Authority","Grant_Amt":2500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Laurens","Type_4":"OneGeorgia","Beneficiaries":"Fred's","JobsPromised":250,"JobsDelivered":236,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"MOU says Fred must pay back certain incentives if they do not reach 150 jobs and $25 million in investment. Competitor is South Carolina. Employee comp $20,800 to $85,000 for top management. Report in June 2004, two months after grant life ended, created 236 jobs and $29.4 million private investment.Freds built two nearby stores in the Dublin area. Grant period was extended to July 2004. City of Dublin and County of Laurens Development Authority. Grant includes $1.5 million for land, $500,000 site prep, $500,000 purchase or lease of machinery and equipment. Distribution center for Fred's Inc., with $25 million private investment . To employ 250 to 300 initially and eventually up to a possible 500. City and county agreed to issue industrial devolpment revenue bonds of up to $40 million. An additional $1 million would come from the state for site prep. The county authority would issue $40 million in bonds, take title of property and equipment and lease to Fred's for 15 years. "},{"Serial":4090,"Award_Date":"06/03/2002","Description":"The Crisp County-Cordele Industrial Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE funds to finish a speculative building to be used as a new lumber product manufacturing facility by US Timber.  US Timber will employ 50 people at the plant and make a private investment of $12.6 million in machinery and equipment (M & E).","Status1":"Closed","Recipient_M":"Crisp/Dooly Joint Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Crisp","Type_4":"OneGeorgia","Beneficiaries":"U.S. Timber","JobsPromised":50,"JobsDelivered":62,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":14100000,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"8/15/2006","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Competed with Alabama.  Jobs $7.50/hr to $12.50/hr with benefits; In  2003 they had created just 22 jobs officials recommended keeping the cased open to give them time to meet employment target; On Sept. 12, 2003 we recommned the closeout visit report but 'jeeping thegrant open untio the bebeficiary has created 50 jobs as stated in the applictaion' Irette Patterson, Grants Consultant DCCrisp-Cordele Industrial Development Authority. Construction and rehab of industrial/commercial buildings. EDGE funds to finish a sepculative building to be used as a new lumber product manufacturing facility by US Timber. Will employ 50. Private investment of $12.6 million in machinery and equipment. "},{"Serial":4091,"Award_Date":"06/04/2002","Description":"The Okefenokee Area Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $500,000 in EDGE funds for machinery and equipment (M & E) to serve the company's new manufacturing facility in Ware County.  Sea-Pak will create 55 jobs and make a private investment of over $2.3 million in additional M & E.  ","Status1":"Closed","Recipient_M":"Okefenokee Area Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Sea-Pak","JobsPromised":55,"JobsDelivered":40,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":2896848,"ActualPrivateInvestment":null,"LocalIncentives":626208,"Public Funds Invested-Actual":null,"Closed Date":"4/10/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"adding new product line, precooked pizza; grant for acq and upgrade of new spiral freezer, pepperoni slicer, elec switch and compressor; 50,000 and 25,000 to be contrinuted by auth and OADA respectively; 15 year abatements on land estimated vale of 551,208; moving into vacant industrial building; had been considering NJ site; product flopped in retail market but was being sold wholesale and in schools. Closes out anyway,"},{"Serial":4092,"Award_Date":"06/14/2002","Description":"The Arabi Industrial Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE funds to pay for a portion of the cost to construct a building for Engineered Stone Products.  Engineered Stone Products is moving from its existing location in Crisp County to this new building to accommodate their expansion, which will retain 26 jobs, create 50 additional jobs, and generate a private sector investment of over $1.5 million.  ","Status1":"Closed","Recipient_M":"Arabi Industrial Development Authority","Grant_Amt":150000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Crisp","Type_4":"OneGeorgia","Beneficiaries":"Engineered Stone Products","JobsPromised":50,"JobsDelivered":15,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":1915000,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"1/29/2003","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"threatening to relocate to huntsville; had 27 jobs there promised to add 50 more; report says 15 create but 35 more by end of 2013, no follow"},{"Serial":4093,"Award_Date":"07/11/2002","Description":"The Barnesville-Lamar County Industrial Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $462,500 in EDGE funds for land acquisition and site preparation to serve B & G's new production facility in Lamar County.  B & G will employ 85 persons and make a total private investment of $2.7 million.  ","Status1":"Closed","Recipient_M":"Barnesville-Lamar County Industrial Development Authority","Grant_Amt":462500,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lamar","Type_4":"OneGeorgia","Beneficiaries":"B&G Equipment Company","JobsPromised":85,"JobsDelivered":85,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":3934744,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"12/22/2005","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"competing with Charlotte NC; company does injection molding and blow molding plastic operation;  average wage of $12 per hour; GaDOT agrees to 275,000 for road work at the plant site"},{"Serial":4096,"Award_Date":"07/31/2002","Description":"Macon-Bibb County Industrial Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $500,000 in EDGE funds for machinery and equipment (M & E) to serve TIMCO's expansion at the Macon airport.  TIMCO will invest approximately $800,000 in additional M & E and 'soft' costs  (training, etc.) associated with the expansion that will allow them to service a new line of aircraft at its facility.  Additionally, TIMCO, who currently employs approximately 200 persons in Macon, expects to add 60 aircraft mechanic jobs with the expansion, and possibly 50 more new jobs in two years.  ","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"TIMCO-Macon","JobsPromised":60,"JobsDelivered":86,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"1/29/2003","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"adding airport mechanic jobs and stock clerks who $12.21 to $18.78 doing maintenance on Aitbus airplnes for America West"},{"Serial":4094,"Award_Date":"08/15/2002","Description":"Liberty County Industrial Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $1,075,000 in EDGE funds for construction of an assembly and distribution facility for eMotion Mobility LLC.  eMotion will create 84 jobs and make a private investment of $2.8 million.   ","Status1":"Closed","Recipient_M":"Liberty County Industrial Development Authority","Grant_Amt":1075000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Liberty","Type_4":"OneGeorgia","Beneficiaries":"eMotion Mobility LLC","JobsPromised":84,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":4475153,"ActualPrivateInvestment":null,"LocalIncentives":532471,"Public Funds Invested-Actual":null,"Closed Date":"11/17/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"dev authority local for site prep and infrastructure; project went belly up due to economy; no clawback?? But emotion paid 2 year lease; owner was Donald Panoz of Chateau Elan; adjusted grant down by 187,960"},{"Serial":4095,"Award_Date":"08/15/2002","Description":"The Grady County Joint Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $450,000 in EDGE funds for acquisition of an existing building to be used as a manufacturing facility by Seminole Marine.  Seminole Marine is expanding their local operations into this building, which will retain 60 jobs, create 40 new jobs, and generate a private investment of $400,000.  ","Status1":"Closed","Recipient_M":"Grady County Joint Development Authority","Grant_Amt":450000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Grady","Type_4":"OneGeorgia","Beneficiaries":"Seminole Marine","JobsPromised":40,"JobsDelivered":95,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":1124000,"ActualPrivateInvestment":null,"LocalIncentives":285525,"Public Funds Invested-Actual":null,"Closed Date":"12/5/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"local incentive is grady county jda"},{"Serial":4110,"Award_Date":"08/27/2002","Description":"The Development Authority of Burke County proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $250,000 in EDGE funds for building renovations to serve Meadwestvacoâ€™s new operation in Burke County.  Meadwestvaco is participating in a joint venture with Applied Ceramics called Purifications Cellutions (PC).  The Purification Cellutions project will create 40 jobs short-term and possibly 100 jobs long-term and will involve a private sector investment of $5.6 million.   ","Status1":"Closed","Recipient_M":"Development Authority of Burke County","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Burke","Type_4":"OneGeorgia","Beneficiaries":"MeadWestvaco","JobsPromised":40,"JobsDelivered":52,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Development Authority of Burke County proposed $250,000 in EDGE funds for building renovations to serve Meadwestvaco new operations in Burke County. A joint venture with Applied Ceramics called Purifications Cellutions. The project will create 40 jobs short term and possibly 100 jobs long-term and will invovled private sector investment of $5.6 million. Automotive emissions control products. Development authority controls building and company to lease for three years. South Carolina and Virginia competing states"},{"Serial":4111,"Award_Date":"09/12/2002","Description":"The Emanuel County Development Authority proposes to use $400,000 in EDGE funds for construction of wastewater improvements to serve Crider, Inc.'s expansion at the Stillmore plant in Emanuel County.  The expansion will create a total of 130 new jobs and generate at least $23 million in private investment by Crider, Inc. ","Status1":"Closed","Recipient_M":"Emanuel County Development Authority","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Emanuel","Type_4":"OneGeorgia","Beneficiaries":"Crider","JobsPromised":65,"JobsDelivered":404,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":28081000,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"10/16/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"chicken canning plant had been destroyed by fire in Lincolnton"},{"Serial":4112,"Award_Date":"11/20/2002","Description":"The Americus-Sumter County Payroll Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $750,000 in EDGE funds to purchase a Cisco 6490 switch, to be leased to STI Knowledge, Inc. for their new call/service center in Americus.  STI anticipates creating at least 150 jobs and investing $3.4 million in this new facility.   ","Status1":"Closed","Recipient_M":"Americus-Sumter Payroll Development Authority","Grant_Amt":750000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Sumter","Type_4":"OneGeorgia","Beneficiaries":"*STI Knowledge (2 grants)","JobsPromised":150,"JobsDelivered":180,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"9/25/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":""},{"Serial":4113,"Award_Date":"11/22/2002","Description":"The Valdosta-Lowndes County Industrial Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $200,000 in EDGE funds for construction of a manufacturing facility for CBC Industries dba American Drill Bushing Company.  Over the next five years, CBC anticipates creating 60 jobs and making a total investment of $21 million, of which approximately $4 million will be in capital improvements.","Status1":"Closed","Recipient_M":"Valdosta-Lowndes County Industrial Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lowndes","Type_4":"OneGeorgia","Beneficiaries":"American Drill Bushing Company (sub. of CBC Industries)","JobsPromised":60,"JobsDelivered":34,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":6075758,"ActualPrivateInvestment":13000000,"LocalIncentives":1005758,"Public Funds Invested-Actual":1205758,"Closed Date":"11/6/2007","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Early report says company will produce 55 jobs; later reports referred to a projection of 60 jobs. DCA report of 8/27/2007 says company is out of the drill bushing business and has invested $13 million.  Company in 1/17/2007 letter says it has had difficulty finding the skilled employees it needs, so it outsourced some of the work. Company says those contracts support eight or nine Georgia jobs. DCA report refers to outsroucing as a way the company 'discovered that they could save money.' QuickStart was utilized by the company, although there are no details. Public funding total reflects cost to county plus EDGE grant."},{"Serial":4114,"Award_Date":"12/05/2002","Description":"The Development Authority of Polk County proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $400,000 in EDGE funds for a speculative building which shall be used as a manufacturing facility by an established business in Polk County.  The expansion by Advance Storage Products will create 59 new jobs (in addition to the 36 already employed) and will generate a private investment of $5.5 million. ","Status1":"Closed","Recipient_M":"Polk County, Development Authority of ","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Polk","Type_4":"OneGeorgia","Beneficiaries":"Advance Storage Products","JobsPromised":59,"JobsDelivered":102,"MetJobGoal":"Y","JobsRetained":36,"ProposedProjectTotal":5900000,"ActualPrivateInvestment":5500000,"LocalIncentives":null,"Public Funds Invested-Actual":400000,"Closed Date":"4/3/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"grant used to offset $1.6 million purchase price on spec building in cedartown, in comp with Chattanooga, Tenn., company based in California; company produces metal storage racks for warehouse and distribution centers, like WalMart, starting wage of $10.50 an hour, no mention of local incentive"},{"Serial":4132,"Award_Date":"12/12/2002","Description":"Thomaston-Upson County Industrial Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $1,700,000 in EDGE funds for acquisition of a former textile building to be used as a manufacturing facility by Atlantic Paper & Foil (APF).  APF plans to establish a new plant in this building which will employ approximately 100 persons initially, with an anticipated total workforce of 360 by 2010.  The company's initial private investment will be $10 million; total investment is expected to increase to over $43 million by 2010. ","Status1":"Closed","Recipient_M":"Thomaston-Upson County Industrial Development Authority","Grant_Amt":1700000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Upson","Type_4":"OneGeorgia","Beneficiaries":"Atlantic Paper & Foil Corporation","JobsPromised":80,"JobsDelivered":40,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":11704000,"ActualPrivateInvestment":5000000,"LocalIncentives":4000,"Public Funds Invested-Actual":1704000,"Closed Date":"3/10/2003","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"company produces napkins, paper towels and alum foil, plans on producing facial tissue, foam plates, trays and bowls. Range of job crearion was 80-100.off to a slow start, factors include mareket conditions, employee training, turnover in management and moving lines from NY, plans 350 jobs in 3 years; LOCI estimates present net value for 10 uyears of 862,678 for 10 years and $1.8 m for 20 years, creedits; total workforce of 360 by 2010 (did they??)project wwas designed to replace shuttered Thomaston Mill"},{"Serial":4135,"Award_Date":"12/30/2002","Description":"The Development Authority of Jefferson County proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $500,000 in EDGE funds for land acquisition and site preparation to facilitate an expansion by Glit/Microtron.  The company, which currently employs 200 employees at the manufacturing and headquarters location in Jefferson County, will create 77 additional jobs there and will make a private investment of $3.4 million.  ","Status1":"Closed","Recipient_M":"Jefferson County, Development Authority of","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Jefferson","Type_4":"OneGeorgia","Beneficiaries":"Glit/Microtron","JobsPromised":150,"JobsDelivered":161,"MetJobGoal":"Y","JobsRetained":220,"ProposedProjectTotal":9073000,"ActualPrivateInvestment":7000000,"LocalIncentives":573000,"Public Funds Invested-Actual":2073000,"Closed Date":"2/20/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":450000,"Co. failed or plant closed":null,"Notes":"actual pub invesment includes 573,000 local loan and 1,000,000 EDA,US DOC (??); company in Wrens, but considered sites in N and S Carolina;manufactures nonwoven floor maintenace and scouring pads; Ga Tech LOCI analysis found 10 yr 450,000 in net benefits"},{"Serial":4136,"Award_Date":"01/14/2003","Description":"Carrollton Payroll Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $2,000,000 in EDGE funds for site preparation, water, sewer, and street improvements, and other costs to serve the new manufacturing facility to be built by Decoma International in Carrollton.  Decoma anticipates creating 302 jobs and making a private investment of $85 million in the project.     ","Status1":"Closed","Recipient_M":"Carrollton Payroll Development Authority","Grant_Amt":2000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Carroll","Type_4":"OneGeorgia","Beneficiaries":"Decoma International","JobsPromised":302,"JobsDelivered":476,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":86500767,"ActualPrivateInvestment":85000000,"LocalIncentives":274054,"Public Funds Invested-Actual":2274054,"Closed Date":"1/26/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":2184949,"Co. failed or plant closed":null,"Notes":"local is for landscaping and signage; app notes tax abataments worth $1.6 m. Ga Tech 10 year LOCI found net present vakue of benefits of $2,184,949; sked of tax abataments outlined in letter from county is 100 percent for first 5 years and then 80,80,60,40,20 for next five years"},{"Serial":4137,"Award_Date":"01/14/2003","Description":"Toombs County Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $340,000 in EDGE funds for street improvements and telecommunications infrastructure to assist Trane's expansion.  Trane Company, an existing company which currently employs 529 in Toombs County, will create at least 67 news jobs and will make a private investment of $2.9 million. ","Status1":"Closed","Recipient_M":"Toombs County Development Authority","Grant_Amt":340000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Toombs","Type_4":"OneGeorgia","Beneficiaries":"Trane Company","JobsPromised":67,"JobsDelivered":75,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":3806000,"ActualPrivateInvestment":3100000,"LocalIncentives":55000,"Public Funds Invested-Actual":395000,"Closed Date":"5/17/2007","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"EIP paid $250,000 to the Development Authority to make a 3 percent loan to the company."},{"Serial":4138,"Award_Date":"02/05/2003","Description":"The Okefenokee Area Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, to use $1.2 million in EDGE funds for construction of a van conversion manufacturing facility for Sherrod Vans.  Sherrod Vans anticipates making a private capital investment of nearly $870,000 and employing 150 persons in three years.  ","Status1":"Closed","Recipient_M":"Okefenokee Area Development Authority","Grant_Amt":1200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Sherrod Vans","JobsPromised":150,"JobsDelivered":26,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":2782976,"ActualPrivateInvestment":182694,"LocalIncentives":713936,"Public Funds Invested-Actual":1913936,"Closed Date":"3/14/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":862678,"Co. failed or plant closed":null,"Notes":"75,000 sq ft manufacturing facility; company buys automobiles from big 3 automakers and install luxury option packages and sel back to dealers; total estimtated cost of facility is 1.7 m so public investment is greater than private; Edge grant of 1.2 m, 500,000 tobe paid by WWDA with splost funds and funds from sale of spec building, OADA supplying land 131,850 free of charge , also cost of relocating drainage ditch 77,184; eng/arch fees 4,902; Sherrod Vans based in Jacksonville, Fla. concerns noted about company financials in project evaluation and recommendation from January 2003 noted concerns about viability olf project beneficiary. 'The financial analysis of Sherrod Vans revealed several weaknesses, including losses in the past several years, negative equity, increasing imnsolvency rations, and the CPA statemenrt regarding the compamy's ability to continue as a growing concern' To minimise the project's risk required $250,000 letterof credit (appears credit expired a grant was extended and state not able to ollect _ see copies); LOCI revelaed 10 year negative net value of present benefits of $239,910; 15 years of tax abataments followed by 5 years graduated abataments (but lesase agreement could chnage sos this could chnage) tax abaremnts valued $1.4 m; site viist shows reviewedpayroll register to verify jobs; 28 on 12/5/05 site visit and phone call saoid 47 on 1/26/06... down to 27 at end after several extensions; local and actual investment does not include propert tax abatments; NEED TO FOLO and see about lease etc"},{"Serial":4139,"Award_Date":"03/05/2003","Description":"The City of Milan proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use EDGE funds for site preparation, road and rail improvements to serve Dash Multi's new facility in Milan.  Dash Multi expects to create 15 new jobs and to make a private investment of over $708,000. ","Status1":"Closed","Recipient_M":"Milan, City of","Grant_Amt":150000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Telfair","Type_4":"OneGeorgia","Beneficiaries":"Dash-Multi Corporation","JobsPromised":15,"JobsDelivered":7,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":5023298,"ActualPrivateInvestment":2413071,"LocalIncentives":60227,"Public Funds Invested-Actual":2610227,"Closed Date":"6/12/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":45920,"Co. failed or plant closed":null,"Notes":"market is slow and sales are down, jobs lagging, company makes rubber products, inckduing acoustic barriers for residential and commercial flooring, rubber mats for horse stalls and dog kennels and rubber floor for gym floors, competing with Oklahoma dn Florida; actual public funds invested include $2.4 million grant for equipment from EPD/DNR"},{"Serial":4140,"Award_Date":"03/05/2003","Description":"The Albany Dougherty Payroll Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, to use $1 million in EDGE funds for construction of a manufacturing facility for American Signature Bedding Company.  American Signature anticipates creating 100 jobs within 24 months and making a capital investment of $2.5 million.","Status1":"Closed","Recipient_M":"Albany Dougherty Payroll Development Authority","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Dougherty","Type_4":"OneGeorgia","Beneficiaries":"American Signature Bedding","JobsPromised":100,"JobsDelivered":30,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":5004350,"ActualPrivateInvestment":2429350,"LocalIncentives":1575000,"Public Funds Invested-Actual":2575000,"Closed Date":"3/31/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"automation made meeting job goals , cross training employees to do 2 jobs;  been able to meet demands of stores with fewer employees than expected. They assemble mattresses and supply Value City etc;  local, incentives are authority providing land 300,000, city of albany 25,000 sewer improvements, and Daughterty County $1.25 million for bldg construction; starting pay is $8-$10 per hr; LOCI analysis not complete at time of review, will lease building for 10years and at end oflease will have option to buy for $100, will pay operating expenses and school taxes as rent; mention f property tax abataments but no specifics"},{"Serial":4141,"Award_Date":"03/10/2003","Description":"The Clinch County Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism (GDITT) recommends, to use $350,000 in EDGE funds for land acquisition and site preparation to serve Sunny Ridge's new berry packaging and distribution center in Clinch County.  With this facility, Sunny Ridge will create 50 jobs and make a private investment of approximately $1.4 million.","Status1":"Closed","Recipient_M":"Clinch County Development Authority","Grant_Amt":350000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Clinch","Type_4":"OneGeorgia","Beneficiaries":"Sunny Ridge, Inc.","JobsPromised":50,"JobsDelivered":63,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":3423311,"ActualPrivateInvestment":2277099,"LocalIncentives":174792,"Public Funds Invested-Actual":1146292,"Closed Date":"11/14/2005","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"berry packaging and distribution center; blueberries, raspberries and blackberries;  public investment includes 500,000 EIP, 121,420 GDOT and 174,792 local funds for water and sewer; site in Homerville"},{"Serial":4153,"Award_Date":"04/30/2003","Description":"The Downtown Waycross Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, to use $500,000 in EDGE funds for renovation of the historic Phoenix Hotel in downtown Waycross to be used as the corporate headquarters for the Jones Company, an existing Ware-County company ('the Company') located in Waycross.  The Jones Company currently employs 80 people in its existing headquarters facilities in Waycross and expects to add 14 new positions at the new corporate headquarters and invest approximately $800,000 in the project in the form of prepaid rent.  ","Status1":"Closed","Recipient_M":"Waycross, Downtown Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Ware","Type_4":"OneGeorgia","Beneficiaries":"The Jones Company","JobsPromised":14,"JobsDelivered":66,"MetJobGoal":"Y","JobsRetained":80,"ProposedProjectTotal":8043732,"ActualPrivateInvestment":4983732,"LocalIncentives":2060000,"Public Funds Invested-Actual":3060000,"Closed Date":"10/1/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"The money would renovate the Phoenix Hotel which covers 1 sq block in downtown Waycross, would turn it into corportate HQ of Jones Co ; would act as anchor for broader downtown redevelopment; 500,000 equity (need more info!!) Jones Co has diverse portfolio of holdings, convenience stores (Flash Foods); auto dealer (Walker Jones), 2 banks (Blackshear Bank and PrimeSoth Bank) and 2 distribution companies (Fuel South and Distribution South); part of the project would be finances through the sale of historic tax credits projected to generate $1,115,430 in revenue'; LOCI found 10 year net value combined for Ware County and Waycross of $45,920. Ware County had negative $102,679 but Waycross is positive $148,599; public funds include 500k equity and 2,060,000 local splost funds"},{"Serial":4159,"Award_Date":"05/20/2003","Description":"Fitzgerald/Ben Hill County Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, to use $605,000 in EDGE funds for the acquisition of a building to house the expansion of Coachmen Recreational Vehicle Company of Georgia, LLC.  The Company will create 175 new jobs and invest approximately $2,000,000 in the project for equipment and building purchase and renovations.","Status1":"Closed","Recipient_M":"Fitzgerald/Ben Hill County Development Authority","Grant_Amt":605000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Ben Hill","Type_4":"OneGeorgia","Beneficiaries":"Coachmen Recreational Vehicle Company of Georgia","JobsPromised":175,"JobsDelivered":140,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":3100000,"ActualPrivateInvestment":2400000,"LocalIncentives":50000,"Public Funds Invested-Actual":700000,"Closed Date":"9/6/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"gas price increase caused a slowdown in themarket, company also says it lost some employees to Frontier RV; facility makes 'laminated towable products'; local 50,000 for land and appraisal"},{"Serial":4162,"Award_Date":"06/06/2003","Description":"The Thomasville Payroll Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, to use $170,000 in EDGE funds for the acquisition of a building by the Thomasville Payroll Development Authority to house the relocation and expansion of DILCO Enterprises, Inc. d/b/a Dillon Candy Company .  The Company, a producer of specialty nut candies, will create 17 new jobs and invest approximately $575,000 in the project for machinery, equipment and building renovation.","Status1":"Closed","Recipient_M":"Thomasville Payroll Development Authority","Grant_Amt":170000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Thomas","Type_4":"OneGeorgia","Beneficiaries":"Dillon Candy Company","JobsPromised":17,"JobsDelivered":8,"MetJobGoal":"N","JobsRetained":32,"ProposedProjectTotal":925000,"ActualPrivateInvestment":730000,"LocalIncentives":25000,"Public Funds Invested-Actual":195000,"Closed Date":"1/11/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":107066,"Co. failed or plant closed":null,"Notes":"invested more thananticipated 575,000 but fell short of job crearion goal. Site visit report called that 'satisfactory given this economic climate.' grant was to relocate an expand Dillon Candy Company to existing 22,000 sf buildimg in Boston, Ga. company is a premier manufacturer of gourmet quality, specialty nut candies, comapny officials report sales are down to poor economic climate; site vist (1/6/10) says created 8 jobs and retained 32 although final report (11/6/08) noted 16 created. Net benefit of jobs and private investment was 87 %; in application for edge funds noted they had an offer to expand in Madison Florida, app notes thatc pomapny is Boston's largest employer and only nonagribusiness industry; LOCI predictes nete benefits over 10 years 107,066 on city of boston and county based on 4 new households"},{"Serial":4163,"Award_Date":"07/18/2003","Description":"The Tift County Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, using $150,000 in EDGE funds to purchase equipment for a new furniture distribution and manufacturing facility for Turner's Distribution Center, Inc.  The Company will create 40 new jobs and invest approximately $2,300,000 in the project for building construction and equipment purchase.","Status1":"Closed","Recipient_M":"Tift County Development Authority","Grant_Amt":150000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Tift","Type_4":"OneGeorgia","Beneficiaries":"Turner's Distribution Center, Inc.","JobsPromised":40,"JobsDelivered":45,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":2500000,"ActualPrivateInvestment":2350000,"LocalIncentives":200000,"Public Funds Invested-Actual":350000,"Closed Date":"5/16/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":319464,"Co. failed or plant closed":null,"Notes":"new furniture distribution and manufacturing center, subsidiary of Turers fine Furniture, edge funds used to purchase equipment storage racking systems, serves 7 retail stores in south grorgia and fla. Panhandle; 4th generation gamily owned s. Ga. furniture retailer; local incentibes is donation of 10 acres of land valued at200,000; LOCI says present net value of benefits at 319,464 for Tifton and Tift County, hourly wage of 15,000-30,000 a year; close out visit was 2003 pre-rcession- need to check and see if they are still ok!!"},{"Serial":4166,"Award_Date":"08/13/2003","Description":"The Development Authority of Burke County proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, using $2,250,000 in EDGE funds to assist with the purchase of an existing building for the location of a manufacturing facility for Fleetguard, Inc.  ('the Company' or 'Fleetguard').  The Company will create 400 new jobs and make a total investment of approximately $21 million, of which $3.4 million will be in the form of a capital investment. ","Status1":"Closed","Recipient_M":"Burke County, Development Authority","Grant_Amt":2250000,"Recaptured_Deob":null,"Recaptured_Acct":1800000,"COUNTY":"Burke","Type_4":"OneGeorgia","Beneficiaries":"Fleetguard","JobsPromised":400,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":23250000,"ActualPrivateInvestment":7000000,"LocalIncentives":300000,"Public Funds Invested-Actual":450000,"Closed Date":"2/5/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":1500,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"manufacturerof exhaust products and systems for diesel engines, and a wholly owned subsiudiary of Cummins Inc.; Waynesboro facility supposed to make mufflers; taking over Kiwkset facility purchased by development authority with bonds and 600,000 in REBA funds in 1995 and leased to Kiwkset; total community grant of 600,000 through the authority offering $1,500 per job created; alsotax abatements; (SEE COPY); actual funds spent are edge funds not recaptured, not sure about county expenditires"},{"Serial":4175,"Award_Date":"09/03/2003","Description":"The Tift County Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, using $500,000 in EDGE funds to purchase machinery and equipment for a new manufacturing and distribution facility for Aladdin Manufacturing Corporation, a wholly owned subsidiary of Mohawk Industries, Inc. ('the Company' or 'Aladdin').  The Company will create 50 new jobs and invest approximately $4,500,000 in the project for building construction and machinery and equipment purchase.","Status1":"Closed","Recipient_M":"Tift County Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Tift","Type_4":"OneGeorgia","Beneficiaries":"Aladdin Manufacturing - Mohawk Industries","JobsPromised":50,"JobsDelivered":55,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":6760000,"ActualPrivateInvestment":5360000,"LocalIncentives":900000,"Public Funds Invested-Actual":1400000,"Closed Date":"3/28/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":357253,"Co. failed or plant closed":null,"Notes":"machinery and equipment purcased for Alliance Carpet Cushion, a divisiom of Alliance Manufacturing, maufcatures and distributed carpet pads primarily to residential markets; local is 500,000 EIP and 400,000 from TDA for building and machinery; LOCI shows for Tifton and Tift County impact over years is 357,253 absed on 39 new householdsand empliyment iof 65"},{"Serial":4176,"Award_Date":"09/05/2003","Description":"Note - This award is tied to 04ge-137-3-4177 for administrative purposes.  The total amount awarded for this project was $500,000. All detail is in file 03ge-4176.  Tift County Development Authority proposes, and the Georgia Department of Industry, Trade and Tourism recommends, to use a $500,000 EDGE grant to the Tift County Development Authority for the purchase of an inventory racking system to serve Orgill's expansion of its existing distribution center in Crossings Park in Tifton, Tift County.  At this new facility Orgill will create 200 jobs and make a private investment of approximately $8 million. ","Status1":"Closed","Recipient_M":"Tift County Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Tift","Type_4":"OneGeorgia","Beneficiaries":"*Orgill (2 grants)","JobsPromised":200,"JobsDelivered":107,"MetJobGoal":"N","JobsRetained":200,"ProposedProjectTotal":10000000,"ActualPrivateInvestment":8000000,"LocalIncentives":1778288,"Public Funds Invested-Actual":2278288,"Closed Date":"3/12/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":2024008,"Co. failed or plant closed":null,"Notes":"Combined w/4163- Orgill based in Memphis Tenn. Wholesale distributor of hardware and related durable good to hardware stores, money would expand existing distribution center in Tifton through purchase of an inventory racking system; cpmpeting with Martinsburg, WV where orgill has another facility; projected jobs in 6 years; hourly rates of 11.33 to 16; LOCI by GaTech prersent net value of benefits of $2,024,008; local incentives include 500,000 EIP and $1.3 m from TCDA for land purchase and site improvement; impacted by downturn in home building"},{"Serial":4178,"Award_Date":"10/09/2003","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism (GDITT) recommends, to use $2.5 million in EDGE grant funds for the Development Authority of Peach County to purchase/refinance machinery and equipment purchased by Blue Bird Body Company for an ongoing expansion of their Peach County facility.  These EDGE funds are requested to assist in the expansion of Blue Bird's existing Peach County facility that currently employs 1,554 people; the Company plans to begin producing new low-floor commercial bus products and a new range of motor homes.  According to the applications, this EDGE grant would support the creation of 90 new jobs at the Peach County facility and the continued retention of the Company's existing employees.  The overall project calls for a total of $17 million in EDGE grants for the retention of 1,500 jobs and the creation of 630 new jobs. ","Status1":"Closed","Recipient_M":"Peach County, Development Authority","Grant_Amt":11000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Peach","Type_4":"OneGeorgia","Beneficiaries":"*Blue Bird Body Company (3 grants)","JobsPromised":630,"JobsDelivered":130,"MetJobGoal":"N","JobsRetained":1500,"ProposedProjectTotal":59300000,"ActualPrivateInvestment":17573000,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"1/26/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Retained 1,500 jobs; File mentions proper procedures not followed; Under Barnes admin Bluebird threatened to go to SC; also mentions $11 million in awards; historically Peach county has produced school buses, owvere that is being moved to LaFayette facility, allowing PC facility to expand commercial bus and motor home manufacturing wile still making school bus chassis for Lafayette operation;  see copies"},{"Serial":4180,"Award_Date":"10/28/2003","Description":"The Development Authority of Washington County proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $350,000 in EDGE grant funds for the Development Authority of Washington County  to purchase machinery and equipment to be leased to an existing industry in Washington County.  J.M. Huber Corporation will retain 154 employees and 92 contractors who might otherwise be unemployed if the plant were shut down due to foreign competition.  The Company expects to make a total private investment of $13,733,000 in new product development and marketing as well as capital improvements to reduce energy usage and expense.","Status1":"Closed","Recipient_M":"Washington County, Development Authority of","Grant_Amt":350000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Washington","Type_4":"OneGeorgia","Beneficiaries":"J.M. Huber","JobsPromised":0,"JobsDelivered":18,"MetJobGoal":"Y","JobsRetained":154,"ProposedProjectTotal":14083000,"ActualPrivateInvestment":13800000,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"12/21/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"; all retention retain 154 employees and 92 contractors; trying to make comp with Brazilian kaolin imports; "},{"Serial":4181,"Award_Date":"11/10/2003","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $315,000 in EDGE grant funds to the Development Authority of the City of Milledgeville and Baldwin County for the purchase of machinery and equipment in support of a five-phase expansion of Aladdin Manufacturing Corporation.  This project will occur in five one-year phases; phase one was completed in 2002.  The Company will create 210 new jobs and invest approximately $15,000,000 in the project's remaining four phases for infrastructure, site preparation, and machinery and equipment over the next three years. ","Status1":"Closed","Recipient_M":"Milledgeville, City of and Baldwin County, Development Authority of","Grant_Amt":315000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Baldwin","Type_4":"OneGeorgia","Beneficiaries":"Mohawk Industries (Aladdin Manufacturing Corporation)","JobsPromised":210,"JobsDelivered":200,"MetJobGoal":"N","JobsRetained":340,"ProposedProjectTotal":15283662,"ActualPrivateInvestment":null,"LocalIncentives":50000,"Public Funds Invested-Actual":null,"Closed Date":"3/22/2004","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Funds for equipment to support five-phase expansoin of Aladdin Manufacturing carpet fiber (yarn) plant. Will create 210 jobs in total (retain 340) and company will invest $15 million. The total project cost is $15 million, but authority to finance project with up to $24 million in bonds. County to provide tax abatements and $50,000 in site work. "},{"Serial":4182,"Award_Date":"11/18/2003","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using a $750,000 EDGE grant to the Dodge County-Eastman Development Authority to pay for modifications to a building and machinery and equipment that will be leased to a trailer producer in Dodge County.  Pace American of Georgia, Inc. will hire 150 new employees and invest nearly $1 million in machinery and equipment and building modifications.  ","Status1":"Closed","Recipient_M":"Dodge County/Eastman Development Authority","Grant_Amt":750000,"Recaptured_Deob":260430,"Recaptured_Acct":null,"COUNTY":"Dodge","Type_4":"OneGeorgia","Beneficiaries":"Pace American","JobsPromised":150,"JobsDelivered":3,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":1711723,"ActualPrivateInvestment":null,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"8/17/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"wants to introduce a new line of all aluminum trailers; was hit by econ downturn, at closeout visit. In 2008 listed 45 jobs; project listed as unsccuesful and 260,430 was deobligated that had been earmarked for office expansion"},{"Serial":4183,"Award_Date":"12/01/2003","Description":"Tift County Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $200,000 in EDGE grant funds for the Tift County Development Authority to purchase machinery and equipment to be owned by the Authority and leased to an existing textile company in Tift County.  After a devastating fire last year, Avondale Mills has retained 85 employees and invested approximately $2 million in repairs to the plant and machinery and equipment instead of closing the facility and relocating the functions to an existing plant in another state.","Status1":"Closed","Recipient_M":"Tift County Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":60000,"COUNTY":"Tift","Type_4":"OneGeorgia","Beneficiaries":"Avondale Mills","JobsPromised":0,"JobsDelivered":0,"MetJobGoal":"","JobsRetained":null,"ProposedProjectTotal":2800000,"ActualPrivateInvestment":1500000,"LocalIncentives":150000,"Public Funds Invested-Actual":null,"Closed Date":"5/16/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"machinery in textile mill which manufactures denim was destroyed by fire. Wants grant to cover uninsured loss; says they will retain 85 jobs; authority agrees to contribute 150k for machinery etc;  Retained 83 jobs, close to total but only invested 1,500,000, state called it 'troubling'"},{"Serial":4184,"Award_Date":"12/10/2003","Description":"Okefenokee Area Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $1,000,000 in EDGE funds for the Okefenokee Area Development Authority to partially fund construction of a new bedding manufacturing/ distribution facility for The Simmons Manufacturing Co., LLC in Ware County.  The project is expected to generate 200 jobs in 24 months and to generate a private investment ranging from $6.75 million to $10 million.  ","Status1":"Closed","Recipient_M":"Okefenokee Area Development Authority ","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Simmons Manufacturing","JobsPromised":200,"JobsDelivered":212,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":12327932,"ActualPrivateInvestment":6750000,"LocalIncentives":2197700,"Public Funds Invested-Actual":null,"Closed Date":"10/15/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"says jobs and private investment confirmed verbally by company officials during site visit; localis 42.3 acres of landd and SPLOSTmoney for building construction and site remediation; EDA and GDOT also pledged 2.1 m for road improvements although funds not cimmitted, Ware County promised to make up difference;  property tax abatementsof 10 years and about $1 million"},{"Serial":4191,"Award_Date":"01/09/2004","Description":"Crisp County-Cordele Industrial Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $243,680 in EDGE grant funds for the Authority to rehab a building and purchase adjacent land, both of which will be owned by the Authority and leased to a food-distribution company in Crisp County.  MBM Corporation anticipates employing 80 or more persons at this facility and making a private investment in excess of $5 million.","Status1":"Closed","Recipient_M":"Crisp County-Cordele Industrial Development Authority","Grant_Amt":243680,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Crisp","Type_4":"OneGeorgia","Beneficiaries":"MBM Corporation  - Meadowbrook Meat Company, Inc","JobsPromised":80,"JobsDelivered":88,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":4778660,"ActualPrivateInvestment":null,"LocalIncentives":93000,"Public Funds Invested-Actual":null,"Closed Date":"3/16/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Crisp Co Powerproviding electrical servive and perimeter lighting; private investment exceeded, proposed 4,442,000 actual 4,855,208"},{"Serial":4192,"Award_Date":"01/16/2004","Description":"The Joint Development Authority of Brooks, Colquitt, Grady, Mitchell, and Thomas Counties proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $1,500,000 in EDGE grant funds to the JDA for the purchase of machinery and equipment for a vegetable-processing facility to be located by A. Duda & Sons, Inc. at the former Sunnyland plant (currently the Genesis Food Park) in Thomasville.  The Company has committed to create 30 jobs, with the potential to grow to 50, and will invest over $4,000,000 in the project for acquisition of the facility and proposed improvements.  The presence of a vegetable-processor in the Genesis Food Park is expected to attract several other small food processors, creating the potential for additional indirect jobs.","Status1":"Closed","Recipient_M":"Brooks, Colquitt, Grady, Mitchell, and Thomas Counties, Joint Development Authority of","Grant_Amt":1500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"A. Duda & Sons, Inc.","JobsPromised":30,"JobsDelivered":43,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":5882547,"ActualPrivateInvestment":null,"LocalIncentives":385000,"Public Funds Invested-Actual":null,"Closed Date":"7/23/2009","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Award period revised to close Jan. 31, 2007. Relocation of a celery processing plant from Florida to Georgia. Development authoirty to use EDGE grant for equipment including freezers, as well as development authority money to buy some used equipment from Florida and for a risk management plan. The development authority also will renovate the facility, which DUDA will purchase from the authority $4 million (the private investment). DCA noted that company also planned to expand by 30 jobs in future with $2 million added investment. "},{"Serial":4193,"Award_Date":"01/30/2004","Description":"The Development Authority of Early County proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $250,000 in EDGE grant funds to the Development Authority of Early County for the purchase of equipment by the Authority that will be leased to the Golden Peanut Company for use at its new facilities in Blakely-Early County.  The Company will create 20 new jobs, retain its existing 30 employees, and invest over $10,000,000 in the project for construction of the expanded facilities and proposed improvements.  The expansion of this peanut-processor in Early County is expected to benefit regional peanut farmers because of the Company's increased demand for raw peanuts.","Status1":"Closed","Recipient_M":"Early County, Development Authority of ","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Early","Type_4":"OneGeorgia","Beneficiaries":"Golden Peanut Company","JobsPromised":20,"JobsDelivered":21,"MetJobGoal":"Y","JobsRetained":30,"ProposedProjectTotal":11651169,"ActualPrivateInvestment":null,"LocalIncentives":522566,"Public Funds Invested-Actual":null,"Closed Date":"3/11/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"City and county agreed to provide up to 500,000 interim finanacing to get project goimg but expected federal reimbursement??? Also authority promised 5 year tax abatment; company had been considering moving to alabama; rail spur never happened because of economic circumstances but locals spent over $20,000; private investment fell short of goal; retained 30 jobs"},{"Serial":4194,"Award_Date":"02/04/2004","Description":"The Thomasville Payroll Development Authority proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using a $250,000 EDGE grant to the Thomasville Payroll Development Authority to assist in the construction of a new 30,000-square-foot manufacturing facility for UWS, Inc.  UWS will hire 49 new employees and invest $1.4 million in a new metal-fabrication facility.  ","Status1":"Closed","Recipient_M":"Thomasville Payroll Development Authority","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Thomas","Type_4":"OneGeorgia","Beneficiaries":"UWS, Inc - United Welding Services, Inc. ","JobsPromised":40,"JobsDelivered":34,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":1997000,"ActualPrivateInvestment":1400000,"LocalIncentives":338000,"Public Funds Invested-Actual":null,"Closed Date":"9/18/2008","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"$250,000 edge for help constructing 30,000 sf factory. 49 new workers and $1.4 million private investment. Authority to borrow up to $2.5 million if necessary backed by lease of the building. Salaries $30,000 to $65,000. "},{"Serial":4195,"Award_Date":"02/05/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $122,146 in EDGE funds for the Macon-Bibb Industrial Authority to purchase machinery and equipment for an aircraft manufacturer in Bibb County.  The project will help retain 30 jobs at The Boeing Company's Macon location and will involve a Company investment of $1.8 million.  ","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":122146,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"The Boeing Company","JobsPromised":0,"JobsDelivered":0,"MetJobGoal":"","JobsRetained":30,"ProposedProjectTotal":1891777,"ActualPrivateInvestment":1772613,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"1/9/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"retain 30 jobs that Boeing says would have been eliminated; could create jobs; "},{"Serial":4196,"Award_Date":"02/09/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $750,000 in EDGE funds for the Middle Georgia Regional Development Authority to purchase machinery and equipment for a paperboard packaging company which is expanding in Houston County.  Graphic Packaging International, Inc., formerly known as Riverwood International Corp., has committed to add 45 jobs to its existing plant in Perry and to make a Company investment of nearly $40 million.  Additional job creation by an on-site subcontractor and other vendors could raise the project's job creation figure to 100.","Status1":"Closed","Recipient_M":"Middle Georgia Regional Development Authority","Grant_Amt":750000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Graphic Packaging International - Riverwood International Corporation","JobsPromised":45,"JobsDelivered":85,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":40053528,"ActualPrivateInvestment":39073528,"LocalIncentives":230000,"Public Funds Invested-Actual":null,"Closed Date":"5/4/2007","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Graphic Packaging wants equipment for an existing plan in Houston County  with commitment to add 45 jobs (at average of $34,000 annual pay) and a commitment to make $40 million in private investment. Competing for expansion with a plant in Louisiana. Expansion of plant to cost $40,053,528, with $750,000 in edge funds and city of perry and Houston development auhtority to provide for free 32.8 acres of land for project.  "},{"Serial":4197,"Award_Date":"02/10/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using a $350,000 EDGE grant to the Joint Development Authority of Brooks, Colquitt, Grady, Mitchell and Thomas Counties to pay for equipment required for a new ultra-filtration plant in Mitchell County.  The equipment will be owned by the Authority and leased to Southeast Milk, Inc., a dairy marketing cooperative with 240 members.  Southeast Milk, Inc. will create 62 new jobs and invest nearly $6 million in building acquisition, construction and building modifications, and machinery and equipment.  ","Status1":"Closed","Recipient_M":"Brooks, Colquitt, Grady, Mitchell, and Thomas Counties, Development Authority of","Grant_Amt":350000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Southeast Milk, Inc.","JobsPromised":62,"JobsDelivered":63,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":6045000,"ActualPrivateInvestment":null,"LocalIncentives":45000,"Public Funds Invested-Actual":null,"Closed Date":"7/23/2009","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Award period extended to Aug. 31,2007. The development authority would purchase equipment to lease to Southeast Milk. Private investment ended up being $7.5 million. "},{"Serial":4198,"Award_Date":"02/25/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $350,000 in EDGE funds for the Putnam Development Authority to purchase machinery and equipment for a mail-order clothing company in Eatonton.  The project is expected to have the following impacts: the creation of 125 new jobs and the retention of 269 current jobs by Haband Company, Inc. in Putnam County; a private investment of $2.4 million by Haband in Putnam County; and the retention of 250 jobs at another Company facility in Athens, Georgia.","Status1":"Closed","Recipient_M":"Putnam Development Authority","Grant_Amt":350000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Putnam","Type_4":"OneGeorgia","Beneficiaries":"Haband Company","JobsPromised":125,"JobsDelivered":211,"MetJobGoal":"Y","JobsRetained":519,"ProposedProjectTotal":2778000,"ActualPrivateInvestment":2233798,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"10/4/2006","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Haband to consolidate distribution facilities. Has two in Georgia. Competing with SC and Pennsylvania. If don't pick Georgia, will consolidate Eatonton and Athens call center in SC. Edge funds to help pay for machinery and equipment. Edge to be $350,000, private to be $2,428,000. Most jobs in the $7 to $10 per hour range. "},{"Serial":4199,"Award_Date":"02/25/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $500,000 in EDGE funds for the Development Authority of Macon County to purchase machinery and equipment for a vegetable processing company in Macon County.  Flint River Foods, LLC has committed to a private investment of $6.8 million as well as the creation of 120 new jobs in three years, growing to 170 jobs in five years.  ","Status1":"Closed","Recipient_M":"Macon County, Development Authority of","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Macon","Type_4":"OneGeorgia","Beneficiaries":"Flint River Foods","JobsPromised":120,"JobsDelivered":262,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":10507809,"ActualPrivateInvestment":8600000,"LocalIncentives":7500,"Public Funds Invested-Actual":null,"Closed Date":"12/10/2008","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"They should get an 'atta boy' on this project for # of jobs created' per state document. Edge funds for $500,000 in equipment purchases. Former Birds eye plant in Montezuma vacant since early 2003. To freeze and can goods. Equipment to be owned by authority and leased to Flint River. Flint River to purchase building from Birds Eye for $1.5 million. Authority to provide $4.3 million in bond financing "},{"Serial":4200,"Award_Date":"03/01/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $1,250,000 in EDGE grant funds for the Thomasville Payroll Development Authority to fund partially the purchase of a building owned by the Authority and leased to a furniture-distribution center in Thomasville.  American Signature, Inc. anticipates a company investment of $18,750,000 and the creation of 167 jobs in thirty months, growing to 213 jobs in four and a half years.  ","Status1":"Closed","Recipient_M":"Thomasville Payroll Development Authority","Grant_Amt":1250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Thomas","Type_4":"OneGeorgia","Beneficiaries":"American Signature, Inc.","JobsPromised":167,"JobsDelivered":73,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":20306000,"ActualPrivateInvestment":7915000,"LocalIncentives":306000,"Public Funds Invested-Actual":null,"Closed Date":"1/31/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"fell short of jobs and investment; proposed investment $18.75 m and actual was $7.9 m; no p&a agreement in place and 'OGA does not have leverage to enforce clawbacks:' Don Sims says the company is a good corporate citizen with strong ties to the community"},{"Serial":4201,"Award_Date":"03/01/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $300,000 in EDGE grant funds for the Development Authority of Emanuel County and the City of Swainsboro to construct a building expansion and provide parking-lot paving for an existing manufacturer in Swainsboro.  Capro, Inc. has committed to retain 130 jobs and create 35 new jobs; the Company is expected to make a capital investment of $145,857 in the expansion.","Status1":"Closed","Recipient_M":"Emanuel County and the City of Swainsboro, Development Authority","Grant_Amt":300000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Emanuel","Type_4":"OneGeorgia","Beneficiaries":"Capro, Inc.","JobsPromised":35,"JobsDelivered":35,"MetJobGoal":"Y","JobsRetained":130,"ProposedProjectTotal":737357,"ActualPrivateInvestment":null,"LocalIncentives":311500,"Public Funds Invested-Actual":null,"Closed Date":"1/28/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"retain 130 and create 35 jobs; company makes mechanical cables for use in snowblowers and lawnmowers; local incentives from authority for rent abatments ans site prep; In the end private investment of 145,857 and public investment of 822,043"},{"Serial":4205,"Award_Date":"03/22/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $770,000 in EDGE grant funds for the Macon-Bibb County Industrial Authority to partially fund site preparation for a new distribution center for a national retailer.  Kohl's Corporation has committed to invest approximately $40 million and to create 200 jobs initially, growing to a total of 500 jobs by the end of the fifth year of operation.  ","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":770000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"Kohl's Corporation","JobsPromised":200,"JobsDelivered":210,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":41986628,"ActualPrivateInvestment":39600000,"LocalIncentives":2350000,"Public Funds Invested-Actual":null,"Closed Date":"8/9/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"local is for fill dirt for site and almost 2m for land donation;  15 year tax abatement from Bibb County worth another 3 million; Ga Tech study questioned local investment (No Study in file??)"},{"Serial":4207,"Award_Date":"04/09/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $400,000 in EDGE grant funds for the Screven County Development Authority to purchase machinery and equipment to be owned by the Authority and leased to a textile company in Screven County.  Westex Acquisitions, LLC has committed to 150 jobs and a private investment of over $2 million.","Status1":"Closed","Recipient_M":"Screven County Development Authority","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Screven","Type_4":"OneGeorgia","Beneficiaries":"Westex Acquisitions, LLC King America Finishing","JobsPromised":23,"JobsDelivered":51,"MetJobGoal":"Y","JobsRetained":127,"ProposedProjectTotal":2428300,"ActualPrivateInvestment":2490665,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"4/16/2007","Reporter Initials":"mk/sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"File only noted 175 or 178 as jobs created, that included jobs retained so jobs delivered column subtratcts to find differerence;  GaTech LOCI study (see Kannell noted)"},{"Serial":4208,"Award_Date":"05/06/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $189,000 in EDGE funds for the Carrollton Payroll Development Authority to purchase machinery and equipment for an airline reservation center in Carrollton.  AirTran Airways anticipates a private investment of at least $1.4 million to equip the call center and the creation of 220 full- and part-time jobs (approximately 154 full-time equivalent positions).","Status1":"Closed","Recipient_M":"Carrollton Payroll Development Authority","Grant_Amt":189000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Carroll","Type_4":"OneGeorgia","Beneficiaries":"AirTran Airways","JobsPromised":154,"JobsDelivered":110,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":1907346,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"4/3/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"company promised 220  full and part time positions; didnâ€™t deliver as many FTE's as promised."},{"Serial":4209,"Award_Date":"05/10/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $625,000  in EDGE grant funds for the Joint Development Authority of Brooks, Colquitt, Grady, Mitchell, and Thomas Counties to partially fund acquisition of an existing industrial building for use as a production facility by a manufacturer of ice-vending machines.  Ice House America, LLC has committed to invest $2.25 million and to create 48 new jobs within the first year, growing to a total of 157 by the third year of operation.","Status1":"Closed","Recipient_M":"Brooks, Colquitt, Grady, Mitchell, and Thomas Counties, Joint Development Authority of ","Grant_Amt":625000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Ice House America, LLC","JobsPromised":157,"JobsDelivered":59,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":4025000,"ActualPrivateInvestment":null,"LocalIncentives":1150000,"Public Funds Invested-Actual":null,"Closed Date":"7/23/2009","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Company committed to 157 jobs over three years. They ultimately created 80 but had that reduced to 59. The company was affected by the downturn. The company met its commitment to $2,250,000 in private investment (it hit $2.3 million). The project 'has satisfied performance standards with a 72 percent weighted average. This project was awarded prior to the requirement of the P*A agreement.' The money was for partial funding of a industrial building. The state noted conflict of interest in the sale/lease of the property. Two partners in GBA Associates were employees/directors of Ice House. They bought the building and 95 acres for $1.85 million. They sold the property to the development authority for $1.75 million. The partners recouped all but $100,000 in the sale and still controlled 67 acres that they could do what they wanted with. The authority then leased the building to Ice House, which had an option to buy the building for $850,000 (building worth $1,75 million.)"},{"Serial":4220,"Award_Date":"06/07/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $200,000 in EDGE grant funds for the Lincoln County Development Authority to partially fund the renovation of a vacated, authority-owned industrial building for use as a production facility by a company relocating to Lincoln County from Louisiana.  Top Grill Imports, LLC (d/b/a Iron Works) has stated it intends to create between 15 and 20 new jobs.","Status1":"Closed","Recipient_M":"Lincoln County Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lincoln","Type_4":"OneGeorgia","Beneficiaries":"Top Grill Imports, LLC (d/b/a Iron Works)","JobsPromised":20,"JobsDelivered":20,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":944371,"ActualPrivateInvestment":360000,"LocalIncentives":383021,"Public Funds Invested-Actual":null,"Closed Date":"4/27/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"local is for building renovation, materials and equip; produc facility relocated from Louisiana; grill manufacturer"},{"Serial":4221,"Award_Date":"06/15/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $650,000 in EDGE funds for the Joint Development Authority of Franklin, Hart, and Stephens Counties to grade an industrial site for a new industry in the new Gateway Hi-Tech Industrial Park.  TI Automotive, a leading supplier of fuel-storage and fluid-carrying systems to automakers, is expected to create 100 to 130 new full-time jobs and invest $33 million.","Status1":"Closed","Recipient_M":"Franklin, Hart and Stephens Counties, Joint Development Authority","Grant_Amt":650000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"TI Automotive","JobsPromised":130,"JobsDelivered":153,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":36047500,"ActualPrivateInvestment":null,"LocalIncentives":1622500,"Public Funds Invested-Actual":null,"Closed Date":"3/19/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"LOCAL INCENTIVE is for site acquisition, water,streets and other infrastructure; company invested 33 millinj"},{"Serial":4222,"Award_Date":"07/12/2004","Description":"The applicant proposes, and the Georgia Department of Industry, Trade & Tourism recommends, using $400,000 in EDGE funds for the Griffin-Spalding Development Authority to purchase machinery and equipment for a new joint venture that has been created to assemble engines in Griffin.  Perkins Shibaura Engines, LLC is a joint venture between Perkins Engines (a wholly owned subsidiary of Caterpillar) and Ishikawajima Shibaura Machinery Ltd. (one of Japan's leading suppliers of small engines and tractors) for the assembly of engines.  The PSE plant in one of Griffin's industrial parks will be the first Perkins facility in North America and the second plant for the joint venture.  PSE has committed to creating 100 new jobs and investing $6 million in the new facility; according to the application, the Company already had 48 employees as of May 17, 2004. ","Status1":"Closed","Recipient_M":"Griffin-Spalding County Development Authority","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Spalding","Type_4":"OneGeorgia","Beneficiaries":"Perkins Shibaura Engines, Ltd","JobsPromised":100,"JobsDelivered":140,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":6405000,"ActualPrivateInvestment":8000000,"LocalIncentives":5000,"Public Funds Invested-Actual":null,"Closed Date":"1/18/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"purchase a paint conveyor system to assemble and distribute 400 series engines; Perkins is a Caterpillar subsidiary"},{"Serial":4226,"Award_Date":"08/19/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, using a $750,000 EDGE grant to the Grady County Joint Development Authority to assist in the construction of a new 112,000-square-foot manufacturing facility for Higdon Furniture Company. Higdon will hire 100 new employees and invest approximately $6.8 million in production machinery and equipment.  Beneficiary for this project was changed to Lining Innovations LLC.","Status1":"Closed","Recipient_M":"Grady County Joint Development Authority","Grant_Amt":750000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Grady","Type_4":"OneGeorgia","Beneficiaries":"Lining innovations, LLC.","JobsPromised":50,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":10582944,"ActualPrivateInvestment":6791295,"LocalIncentives":2616387,"Public Funds Invested-Actual":null,"Closed Date":"11/20/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"closed Cairo facility"},{"Serial":4227,"Award_Date":"09/01/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, using $1,000,000 in EDGE funds for the Adel Industrial Development Authority to purchase land for a feed mill and hatchery for a large, national poultry processor.  Sanderson Farms, Inc. is a publicly traded company headquartered in Mississippi.  The Company's goal is to establish a fully integrated poultry operation including a feed mill, hatchery, contract growers and a processing plant.  The Company's Adel facilities will create 160 jobs and will result in private investment of almost $17 million; the processing facility will be located in Moultrie.  According to GDED, Georgia was competing with Texas and Alabama for this project.","Status1":"Closed","Recipient_M":"Adel Industrial Development Authority","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Cook","Type_4":"OneGeorgia","Beneficiaries":"Sanderson Farms, Inc","JobsPromised":160,"JobsDelivered":160,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":18700000,"ActualPrivateInvestment":19000000,"LocalIncentives":630600,"Public Funds Invested-Actual":null,"Closed Date":"8/28/2007","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Extended to May 2007. City, county and state actually delivered $2,170,443.31 in local incentives and infrastructure costs. Development authority will issue bonds for the estimated $16.7 million construction costs and equipment needed and will donate 14 acres in the Adel industrial park for the hatchery site. The city and county will provide $300,000 in infrastructure improvements. Total local incentives of $630,600 plus $175,000 in DOT road improvements. Investment equaled $21.6  million"},{"Serial":4228,"Award_Date":"09/01/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, using $2,275,000 in EDGE funds for the Moultrie-Colquitt County Development Authority to assist in the purchase of approximately 1,068 acres of land to be used for a land-application spray field that is needed to support the waste-water treatment for a processing facility for a large, national poultry processor.  Sanderson Farms, Inc. is a publicly traded company headquartered in Mississippi.  The Company's goal is to establish a fully integrated poultry operation including a processing plant, feed mill, hatchery, and relationships with regional contract growers.  The Company's processing facility in Moultrie will create 1,400 jobs and result in over $80 million in private investment.  Adel and Cook County will be home to the hatchery and feed mill facilities.  According to GDED, Georgia was competing with Texas and Alabama for this project.","Status1":"Closed","Recipient_M":"Moultrie-Colquitt County Development Authority","Grant_Amt":2275000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Colquitt","Type_4":"OneGeorgia","Beneficiaries":"Sanderson Farms, Inc","JobsPromised":1400,"JobsDelivered":1420,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":86159086,"ActualPrivateInvestment":80434086,"LocalIncentives":3300000,"Public Funds Invested-Actual":null,"Closed Date":"1/12/2010","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Edge funds to go toward purchase of 1,068 acres for a land-application spray field to support waste-water treatment for a poultry processing facility. The development authority is providing 185 acres (worth $1,000,000) for a poultry facility that Sanderson will build. Georgia competed with Texas and Alabama for the plant. "},{"Serial":4236,"Award_Date":"09/22/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, using $490,000 in EDGE funds for the Development Authority of Gordon County to fund land acquisition costs for a new industry in Gordon County.  LG Chem Industrial Materials, Inc. has committed to create 70 new jobs and to make a private investment of $40 million.","Status1":"Closed","Recipient_M":"Gordon County, Development Authority of ","Grant_Amt":490000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Gordon","Type_4":"OneGeorgia","Beneficiaries":"LG Chem Industrial Materials, Inc.","JobsPromised":70,"JobsDelivered":77,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":45183671,"ActualPrivateInvestment":null,"LocalIncentives":765161,"Public Funds Invested-Actual":null,"Closed Date":"7/31/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"additional aid is 500,000 OneGeorgia Equity Grant; GEFA loan of 2.6 m EIPof 500,000; GDOT 328,507; Gordon County 650,233 and city of Calhoun 43,761, Company 40 m;  Company exp verified"},{"Serial":4237,"Award_Date":"10/28/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $200,000 in EDGE funds for the Fitzgerald and Ben Hill Development Authority to purchase equipment for a new industry in Ben Hill County.  U.S. Paper Converters, Inc. has committed to create 40 new jobs and to make a private investment of $2.8 million through a wholly-owned but independent subsidiary, Fitzgerald Paper Converting, LLC, that was created specifically for this project.","Status1":"Closed","Recipient_M":"Fitzgerald/Ben Hill County Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Ben Hill","Type_4":"OneGeorgia","Beneficiaries":"Fitzgerald Paper Converting, LLC","JobsPromised":40,"JobsDelivered":20,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":3000000,"ActualPrivateInvestment":null,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"mentions tht accountability agreement would perhaps allow for clawback; private investment and jobs (see phone photo)"},{"Serial":4238,"Award_Date":"11/10/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $250,000 in EDGE funds for the Development Authority of Richmond County to fund land acquisition for a new industry in Augusta-Richmond County.  FedEx Ground has committed to create 40 new full-time jobs and 40 new part-time jobs, and to make a private investment of $920,000.","Status1":"Closed","Recipient_M":"Richmond County, Development Authority of","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Richmond","Type_4":"OneGeorgia","Beneficiaries":"FedEx ","JobsPromised":40,"JobsDelivered":41,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":3650,"ActualPrivateInvestment":3992249,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"12/11/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"GDOT 85,000 incentive for road improvements; While the project exceeded private investment overall FedEx actually contributed less than promised actual 860,000 and Augusta Baseline 3,132,249. FedEx proposed 920,000 Augusta Baseline 2,395,000. The deal invokved DevAuth will obtain title to land and facility then lease it ti Augusta Baseline Development LLC will sublease to FedEx; Fed Ex etsblishing ground distribution centers. The project would create a ground distribution center."},{"Serial":4241,"Award_Date":"12/17/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $610,000 in EDGE grant funds for the Development Authority of Columbus, Georgia ('the Authority').  EDGE funds will be used to help fund the acquisition of a former cotton gin site and facilities for use as the Southeast Regional Headquarters and trailer remanufacturing operations of an auto transport company.  The Waggoners Trucking ('the Company' or 'TWT') has committed to an initial investment of $5 million and to create at least 150 corporate and manufacturing jobs and up to 300 auto transport jobs.","Status1":"Closed","Recipient_M":"Columbus, Georgia, Development Authority of","Grant_Amt":610000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"The Waggoners Trucking","JobsPromised":150,"JobsDelivered":135,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":5810000,"ActualPrivateInvestment":4500000,"LocalIncentives":700000,"Public Funds Invested-Actual":null,"Closed Date":"1/15/2010","Reporter Initials":"mk/sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"company said also up to 300 auto transport jobs but not guaranteed; See Kannell's notes on QuikStart etc; fell short of 5 million private investment; local incentives include development authority and cityof columbus for bldg/land acquisition as well as site prep"},{"Serial":4254,"Award_Date":"01/31/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $3,000,000 in EDGE grant funds for the Liberty County Industrial Development Authority ('the Authority or LCIDA'). EDGE funds will be used to assist with the location of a distribution center within the Liberty Ridge section of the MidCoast Business Center.  Target Corporation ('the Company' or 'Target') has committed to an initial investment of $85 million and to create at least 600 full-time jobs within three years (496 jobs within the first two years.)","Status1":"Closed","Recipient_M":"Liberty County Industrial Development Authority","Grant_Amt":3000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Liberty","Type_4":"OneGeorgia","Beneficiaries":"Target Corporation","JobsPromised":496,"JobsDelivered":503,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":94785000,"ActualPrivateInvestment":109580721,"LocalIncentives":2000000,"Public Funds Invested-Actual":null,"Closed Date":"3/18/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"private investment exceeded promised amount 106 m invested up from 85 m proposed; local incentives include Liberty County and City of Hinesville for street improvements; also $1 m from GDOT for street improvements also $2 m from EDA (?) for water and sewer improvements; majority of new jobs will pay from $10.20 to $12 per hour; LOCI shows negative local impact (See phone photo)"},{"Serial":4256,"Award_Date":"02/15/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $760,000 in EDGE funds for the Development Authority of Gordon County (the Authority) to partially fund site preparation costs to assist Aladdin Manufacturing Corporation, a wholly-owned subsidiary of Mohawk Industries (Mohawk or the Company) with an expansion of its existing operations in Gordon County.  For this consolidation and expansion project, Mohawk has committed to retain 485 jobs, create 130 new full-time jobs over five years, and invest at least $22 million in the project.    ","Status1":"Closed","Recipient_M":"Gordon County, Development Authority of","Grant_Amt":760000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Gordon","Type_4":"OneGeorgia","Beneficiaries":"Aladdin Manufacturing Corporation, subsidiary+L100 of Mohawk Industries","JobsPromised":130,"JobsDelivered":130,"MetJobGoal":"Y","JobsRetained":485,"ProposedProjectTotal":35880474,"ActualPrivateInvestment":30000000,"LocalIncentives":1860826.85,"Public Funds Invested-Actual":null,"Closed Date":"7/31/2008","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Local contributions over two fiscal year budgets include street and other improvements; paving cost $796,181.79. State's final report public funding at $1.9 million, the EDGE grant is $760,000, so it's not clear how they are counting.  "},{"Serial":4259,"Award_Date":"03/28/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $130,000 in EDGE funds for the Wayne County Industrial Development Authority (WCIDA or the Authority) to partially fund water and street improvements to assist Great Southern Wood Preserving, Inc. (GSWPI or the Company) with an expansion into Wayne County.  GSWPI has committed to retain 69 jobs, create 20 new full-time jobs within two years, and invest at least $7.7 million in the project.    ","Status1":"Closed","Recipient_M":"Wayne County Industrial Development Authority","Grant_Amt":130000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Wayne","Type_4":"OneGeorgia","Beneficiaries":"Great Southern Wood Preserving","JobsPromised":20,"JobsDelivered":36,"MetJobGoal":"Y","JobsRetained":69,"ProposedProjectTotal":null,"ActualPrivateInvestment":12000000,"LocalIncentives":359600,"Public Funds Invested-Actual":null,"Closed Date":"10/5/2010","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Edge funds for water and sewer improvements at Great Southern Wood Preserving. GSPWI is nation's second largest producer of pressure-treated lumber. A relocation and expansion of a Statesboro (Bulloch County) plant. No suitable site in Bulloch County, company eyeing other states. County and city incentives include in-kind grading, land, construction of a well. City providing EIP grant money and GDOT providing $156,000 in road improvements. Wages for most jobs in the $9.28 per hour to $725 per week range. Positive 10-year LOCI projection of $677,966 for Jesup and Wayne County. Grant period through March 2007 extended to September 2007"},{"Serial":4261,"Award_Date":"04/05/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $486,000 in EDGE funds for the Bryan County-Pembroke Development Authority ('the Authority') to fund land acquisition costs for a new industry in Bryan County.  ORAFOL USA ('the Company') has committed to create 50 new full time jobs and make a private investment of $42 million.","Status1":"Closed","Recipient_M":"Bryan County-Pembroke Development Authority","Grant_Amt":486000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bryan","Type_4":"OneGeorgia","Beneficiaries":"ORAFOL USA","JobsPromised":50,"JobsDelivered":85,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":42410946,"ActualPrivateInvestment":57000000,"LocalIncentives":5000,"Public Funds Invested-Actual":null,"Closed Date":"8/14/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"new company incorporated in 2004; german based manufacturer and producer of self adhesive graphic products; GDOT pledged 243,946 for road improvements; authority 5,000 for program administration; company surpassed private investment and job creation (85 FT and 40 temp jobs); 2 new distributors have also joined them in industrial park : Oneida and Kawasaki"},{"Serial":4263,"Award_Date":"04/20/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $1,500,000 in EDGE grant funds for the Macon-Bibb County Industrial Authority ('the Authority' or 'MBCIA'). EDGE funds will be used to assist with the location of a distribution center on a 60-acre tract adjacent to Interstate 75 on Bass Road in Bibb County. Bass Pro Shops, Inc. ('the Company' or 'Bass Pro') has committed to an initial investment of $34 million, and to create up to 400 full-time jobs as a result of the new distribution and retail center within 5 yrs.  The initial job creation will be 270 (120 at the distribution center and 150 at the retail component.) ","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":1500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"Bass Pro Shops, Inc.","JobsPromised":270,"JobsDelivered":385,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":53160498,"ActualPrivateInvestment":34000000,"LocalIncentives":3819080,"Public Funds Invested-Actual":null,"Closed Date":"1/5/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Local incentives include Bibb County and authority, which funded land acquisition and site prep; company promised 400 jobs over 5 years and completed 96 percent of that goal."},{"Serial":4260,"Award_Date":"04/21/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $3,000,000 in EDGE funds for the Houston County Development Authority (the Authority) to partially fund capital improvements to an existing chicken processing facility to be acquired and expanded by Perdue Farms.  Perdue Farms has committed to acquire and expand the Cagle's facility in Perry, to retain the 1,150 existing jobs which otherwise would be lost, and to create an additional 700 jobs.  Perdue is investing over $40 million to acquire the Cagle's plant and will make an additional capital investment of $6 million for plant renovation.  ","Status1":"Closed","Recipient_M":"Houston County Development Authority","Grant_Amt":3000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Houston","Type_4":"OneGeorgia","Beneficiaries":"Perdue Farms","JobsPromised":700,"JobsDelivered":581,"MetJobGoal":"N","JobsRetained":1150,"ProposedProjectTotal":54000000,"ActualPrivateInvestment":48000000,"LocalIncentives":0,"Public Funds Invested-Actual":null,"Closed Date":"9/25/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Notes that final report overstated job creation numbers; old Cagles plant; eliminated third shift through improving efficiency so less jobs; "},{"Serial":4264,"Award_Date":"04/22/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $2,000,000 in EDGE funds for the Southeast Georgia Regional Development Authority ('the Authority' or 'SEGRDA') to purchase and make modifications to an existing 135,000 square-foot building for a new industry in Appling County.  Contender Boats ('Contender' or 'the Company') has committed to create 234 new full-time jobs within one year and increasing to 424 in five years.  The Company also committed to an initial private investment of $6,385,556 and an additional investment of $4.3 million over the first five years.","Status1":"Closed","Recipient_M":"Southeast Georgia Regional Development Authority","Grant_Amt":2000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Contender Boats","JobsPromised":234,"JobsDelivered":2,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":12840556,"ActualPrivateInvestment":544727,"LocalIncentives":155000,"Public Funds Invested-Actual":null,"Closed Date":"12/23/2010","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Could find no final report in the files, only memos from 2007 on describing situation. Grant deobligation."},{"Serial":4265,"Award_Date":"05/03/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $500,000 in EDGE funds for the Fitzgerald-Ben Hill County Development Authority (the Authority) to fund construction of a new facility to assist American Blanching Company, (ABC or the Company), with an expansion of its existing operations in Ben Hill County.  For this expansion project, ABC has committed to create 100 new full-time jobs in addition to the existing 161 employees and invest approximately $3.2 million in the project.    ","Status1":"Closed","Recipient_M":"Fitzgerald/Ben Hill County Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Ben Hill","Type_4":"OneGeorgia","Beneficiaries":"American Blanching Company","JobsPromised":100,"JobsDelivered":100,"MetJobGoal":"Y","JobsRetained":161,"ProposedProjectTotal":3747375,"ActualPrivateInvestment":3200000,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"12/27/2006","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"American Blanching Company, a peanut processor outside Fitzgerald, is making its second phase of expansion. Has signed an agreement for ABC to make Unilever's peanut butter, moving that business from Canada and Arkansas to Fitzgerald. Need to build a 22,500 sf expansion of its plant. Edge funds will be used in part for expansion. ABC got a loan to begin construction, but wil transfer title of the expansion to the development authority and lease it back. By December 2005, the company met its job creation, retention and investment goals, per closing documents. A state audit said: 'Good report, right project.'  "},{"Serial":4266,"Award_Date":"05/25/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $500,000 in EDGE funds for the Thomasville Payroll Development Authority (the Authority) to help fund building construction costs for a new ground beef products producer in Thomasville, Georgia. American Fresh Foods, LP (the Company) has committed to invest $11.75 million in facility and machinery and equipment and to create 100 new full-time jobs with the project.  ","Status1":"Closed","Recipient_M":"Thomasville Payroll Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Thomas","Type_4":"OneGeorgia","Beneficiaries":"American Fresh Foods","JobsPromised":100,"JobsDelivered":99,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":12775000,"ActualPrivateInvestment":null,"LocalIncentives":525000,"Public Funds Invested-Actual":null,"Closed Date":"9/18/2008","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Edge funds for a ground beef products facility. Eventually making burger patties for Burger King. Competing with Florida. Funds to help building construction costs of a 75,000 sf manufacturing site. Grant deadline May 2007. Extended to August 2008.  Authority will own project (land, facility and equipment) and lease it to American Fresh Foods for 10 years with debt service on bonds covered by rent. Wages $8 to $15 per hour for production, $30,000 to $85,000 per year for administrative jobs. Payroll at full production is $2.7 million. Local incentives include $375,000 for land and site prep, $150,000 in public utiliities work/power incentives  from City of Thomasville. A ten year LOCI impact analysis conducted projects a NEGATIVE president value of neet benefits of $1.2 million, but positive statewide impact of $1.6 million, netting a positive 10-year state impact of $400,000 approx. A letter later explains the LOCI gives too much of a loss factor related to the value of the power incentive and that local impact is positive. Doesn't say by how much. "},{"Serial":4272,"Award_Date":"06/14/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $500,000 in EDGE funds for the Grady County Joint Development Authority to fund a portion of the cost to expand a building for an existing industry in Cairo, Grady County.  MacTavish Furniture Industries (the Company or MacTavish), is the furniture manufacturing division of Aaron Rents, Inc. (Aaron), an industry leader in rental, lease-ownership and specialty retailing of residential and office furniture, consumer electronics, household appliances and accessories.  In 1998, Aaron, through its MacTavish division, located a 200,000-square-foot manufacturing and distribution center in Cairo, making approximately $3 million in private investment and creating 200 new jobs.  In 2002 the Company used $150,000 of EDGE funding for site preparation to help expand the facility's office-furniture manufacturing operation.  The Company created 80 additional jobs and invested $575,000 in the expansion.  Company growth and increased share in the office furniture market have created an opportunity for the Cairo facility to expand again.","Status1":"Closed","Recipient_M":"Grady County Joint Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Grady","Type_4":"OneGeorgia","Beneficiaries":"MacTavish Furniture Industries","JobsPromised":111,"JobsDelivered":73,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"9/27/2010 and 3/9/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Edge funds for an expansion of a McTavish (Aaron Rents/now known as Aaron's Inc.) furniture plant and distribution center. Grady JDA seeking $500,000 to help fund 98,000 sf expansion that would employ 110 (later 111) people. Total projected cost $3,183,774. Local incentives originally of $193,000, raised to $223,000 in the LOCI. Projected to add 111 jobs in two years and close grant June 2007. ***First Final Report September 2010: 'Its performance has been less than satisfactory due to the recession. The highest job level achieved was 237. The project began with 177 jobs; so the new job creation reached 60 or 54% of projections. However, private investment exceeded projections (125%). Based on the highest level of jobs achieved and the significant private investment, the weighted average of both measurements was 89.5%. Although the project currently reports no new jobs, additional jobs are expected by the end of the year as a result of the holday season. Although the project was unsuccessful, it has been open for five years and the situation does not appear to be improving. Recommend that we accept as a final report.' Also from FIRST FINAL REPORT: 'The JDA constructed and financed additonal facilities beyond the origiinal planned building Included was a lumber storage shelter and dust removal system for the building. Site work was much more expensive than originally anticipated... At peak employment 60 jobs were created by the compnay, based on a beginning figure of 177 jobs at the plant. Total employmnet was 237. At present there are 143 total employees.** Company management anticipates adding 36 jobs  in the fourth quarter of 2010, bringing total employment to 179 jobs -- a net increase of 2 jobs assocciated with the Edge project. Plant employment levels have fluctuated basedon the easonal nature of the industry, but have trended downward with the economic recession.' Noted in May 2009 progress report 'there are no clawback provisions for this project, however the company is optimistic that economic condiitions will improve within 6 months which will allow theme to hire add'l employees.' (recommended extension). ***Second Final Report from May 2011: The construction is complete and the company is operating with 250 employees according to Tommy Harper, plant manager. The company operates only one shift, and they are in the midst of their busy season. As of the 9/15/10 final report, the company had 143 jobs with no new job creation.' (note that would be a loss of 34 jobs from start). 'At project inception, there were 177 jobs with a commitment to create 111 jobs for a total job figure of 288. Due to seasonality of the industry, there are fluctuations in job levels. Based on the current job figure (250-177), the company has creted 73 new jobs... The awared period expired 11/15/10 and the final report was approved on 9/29/10.' ... 'Although this project is not bound by a P&A (a clawback) their current job levels are satisfactory and the weighted average performance standard totals 95.5 percent. However, it should be noted that this industry has seasonal peaks with this current levels represent.'"},{"Serial":4276,"Award_Date":"08/08/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $250,000 in EDGE funds to the Carrollton Payroll Development Authority to fund machinery and equipment for a new manufacturer in Carroll County's State Enterprise District.  Bobcat Company will create at least 100 new jobs and make a private investment of $8.59 million.  The Joint Development Authority of Carroll, Haralson, Heard, Polk, and Troup Counties is a co-applicant.","Status1":"Closed","Recipient_M":"Carrollton Payroll Development Authority","Grant_Amt":250000,"Recaptured_Deob":13670,"Recaptured_Acct":180000,"COUNTY":"Carroll","Type_4":"OneGeorgia","Beneficiaries":"Bobcat Company","JobsPromised":100,"JobsDelivered":185,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":8840000,"ActualPrivateInvestment":9590000,"LocalIncentives":0,"Public Funds Invested-Actual":0,"Closed Date":"2/19/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":378190,"Co. failed or plant  closed":"yes","Notes":"facility dedicated to production of attachments, such as skid steer loading attachments; final report dated 9/8/08 noted 185 jobs and investment exceeding proposed. By 2/3/09 files says facility is closinh. Cvompany offered to buy the EDGE funded equipment $180,000 or 76% of amount funded; another 13 million deobligated; Regional 10 year LOCI net bebnefits of $378,190"},{"Serial":4275,"Award_Date":"08/10/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $3,000,000 in EDGE funds for the Tallapoosa Development Authority ('the Authority') to fund land acquisition costs for a new industry in Haralson County.  Honda Motor Company, Inc., ('the Company') has committed to create 400 new full-time jobs and make a private investment of over $115 million.","Status1":"Closed","Recipient_M":"Tallapoosa Development Authority","Grant_Amt":3000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Haralson","Type_4":"OneGeorgia","Beneficiaries":"Honda Motor Company, Inc.","JobsPromised":400,"JobsDelivered":547,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":124250419,"ActualPrivateInvestment":174700000,"LocalIncentives":1542616,"Public Funds Invested-Actual":6823881,"Closed Date":"4/6/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":9000000,"Co. failed or plant closed":null,"Notes":"Local incentives are$1.2 m GEFA/city loan for water tank; 349,898 city grant for gas line; additionally GDOT $2.3 million for access road; LOCI analysius showed net value of almost $9 million over 10 years; EDGE estimated per job costof $7,500 per job based on 400 jobs; hourly rates$13-$17.25 per hour; plant does powertrain assembly"},{"Serial":4281,"Award_Date":"09/15/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $500,000 in EDGE funds to the Development Authority of Richmond County (Authority) to reduce building acquisition costs for a new company ipn Augusta.  NBTY, Inc. (Company) has committed to create up to 125 jobs and invest $30 million initially, possibly growing to 500 jobs and $40 million, respectively, in three years.","Status1":"Closed","Recipient_M":"Richmond County, Development Authority of","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":500000,"COUNTY":"Richmond","Type_4":"OneGeorgia","Beneficiaries":"NBTY, Inc.","JobsPromised":125,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":38030000,"ActualPrivateInvestment":0,"LocalIncentives":0,"Public Funds Invested-Actual":0,"Closed Date":"12/11/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"new manufacturing and packaging plant at former Bill's Dollar Store; project costs came in over expected and project was scrapped; NBTY returned all funds; NBTY makes nutritional supplements _ vitamins and minerals"},{"Serial":4282,"Award_Date":"09/20/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $750,000 in EDGE funds to the Valdosta-Lowndes County Industrial Authority (Authority) to reduce site preparation costs for an expanding company in Valdosta.  Lowe's (Company) will retain 637 jobs, create at least 100 new jobs, and make a private investment of $23.5 million.  The Lowndes, Lanier, Berrien, Echols, and Clinch Development Authority (Joint Authority) is co-applicant.","Status1":"Closed","Recipient_M":"Valdosta-Lowndes County Industrial Authority","Grant_Amt":750000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lowndes","Type_4":"OneGeorgia","Beneficiaries":"Lowe's","JobsPromised":100,"JobsDelivered":239,"MetJobGoal":"Y","JobsRetained":637,"ProposedProjectTotal":28839251,"ActualPrivateInvestment":25201251,"LocalIncentives":2638000,"Public Funds Invested-Actual":3388000,"Closed Date":"2/2/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":536302,"Co. failed or plant closed":null,"Notes":"local incentives are VLCIA $2.5 m for land and City of Valdosta 100,000 for permitting and inspection; locals say without the EDGE Grant the project could be lost to Alabama or Mississippi; 10 year LOCI analysis based on 200 new jobs indicates net vaoue of $536,302"},{"Serial":4283,"Award_Date":"10/19/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $300,000 in EDGE funds to Development Authority of Columbus (the 'Authority') to reduce building costs for a new industry in Columbus.  ICForm Inc. (also known as Polyform) will create 100 new jobs and to make a private investment of at least $10 million over three years.   ","Status1":"Closed","Recipient_M":"Columbus, Development Authority of","Grant_Amt":300000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"ICForm Inc.","JobsPromised":100,"JobsDelivered":20,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":16826700,"ActualPrivateInvestment":10000000,"LocalIncentives":526700,"Public Funds Invested-Actual":826700,"Closed Date":"2/15/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Polyform makes foam type products used in inconstruction meterials, packaging and insulation; Hit hard by housing downturn because major buyers are housing and construction companies; Not bound by P&A agreement but says incentive agreement stiplutaes they can clawback in they terminate prior to 2025, Employment well below goial but has held steady over the last few years. Called them 'good stewards' in Columbus. 'The company and the community fully expect them to rebound when the housing market does.'"},{"Serial":4288,"Award_Date":"10/19/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $120,000 in EDGE funds to the Development Authority of Union County ('Authority') to reduce land acquisition costs for a new industry in Blairsville.  Applewood Doors & Windows, Inc. ('Company') will retain 23 jobs in the state of Georgia, create 27 new jobs in Union County, and make a private investment of at least $3.3 million.","Status1":"Closed","Recipient_M":"Union County, Development Authority of","Grant_Amt":120000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Union","Type_4":"OneGeorgia","Beneficiaries":"Applewood Doors & Windows, Inc. ","JobsPromised":27,"JobsDelivered":28,"MetJobGoal":"Y","JobsRetained":23,"ProposedProjectTotal":4707000,"ActualPrivateInvestment":3465000,"LocalIncentives":938426,"Public Funds Invested-Actual":938426,"Closed Date":"1/25/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Final report indicated that while job goals had been met the company was facing financial stress b/c of downturn in the housing market and suggested 19 jobs had been eliminated. The company is a manufacturer of wooden doors and windows and sells in a small area around Elllijay. parent company is Ace Hardware; In application it notes 'In addition to posting losses during 2002 and 2003, Applewood is technically insolvent as evidenced by its negative equity for the past 3 years. However, according to an insolvency ratio, Applewood's equity posution is inproving.' They seemed by parent company (Ace). LOCI found negative net benefit of $511,055. But local officials wanted the project anyway. That included 500k in sewer improvements but city said it was going to apply for AIP grant. It appears they got some EIP money."},{"Serial":4293,"Award_Date":"02/10/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $200,000 in EDGE funds to the Fitzgerald & Ben Hill County Development Authority to fund building improvements to an existing industrial building and equipment for a new manufacturer to locate in Fitzgerald.  Frontier RV Georgia, LLC will create at least 125 new jobs and make a private investment of $1.51 million.","Status1":"Closed","Recipient_M":"Fitzgerald/Ben Hill County Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Ben Hill","Type_4":"OneGeorgia","Beneficiaries":"Frontier RV","JobsPromised":125,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":2312500,"ActualPrivateInvestment":1540780,"LocalIncentives":600000,"Public Funds Invested-Actual":800000,"Closed Date":"6/30/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"local is for building and acq; came in prior to p&a so no agreement; company went out of business; at one time created 161  jobs and exceeded investment; relied on FEMA contracts that did not materialize"},{"Serial":4295,"Award_Date":"02/24/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $250,000 in EDGE funds to the Toombs County Development Authority (the Authority) to fund building improvements to the Authority's 100,000 square foot speculative building for a new manufacturer to locate in Lyons.  Simonton Building Products, Inc. will create at least 85 new jobs and make a private investment over a three year period of $9.94 million.","Status1":"Closed","Recipient_M":"Toombs County Development Authority","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Toombs","Type_4":"OneGeorgia","Beneficiaries":"Simonton Building Products, Inc. ","JobsPromised":85,"JobsDelivered":195,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":10200911,"ActualPrivateInvestment":20000000,"LocalIncentives":5000,"Public Funds Invested-Actual":255000,"Closed Date":"10/4/2007","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":3500,"LOCI (10 yrs unless noted)":1100000,"Co. failed or plant closed":null,"Notes":"manufactures vinyl replacement and new construction alum windows for sale in residential marketplace' local is 5,000 for project admin; should be eligible for Jobs tax creedit of 3,500 per eligible employee' LOCI10 year impact on county net benefitr of $1.1 million; real property taxes abated for Toombs County and Lyons for 10 years with the exception of school taxes in which a fee will be paid in lieu of taxes; Full taxes will paid on personal property in yearr 4 of project; makes useof speculative buidling; located in arera of hi econ need; subject to clawback at 70 percent level; exceeded proposed private investment of $9.9 m"},{"Serial":4296,"Award_Date":"02/24/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $850,000 in EDGE funds to the Development Authority of LaGrange (the 'Authority') for building acquisition costs for a new company in LaGrange.  According to its commitment letter, ae light metal casting, inc. (the 'Company') will create 105 jobs and invest $3.9 million in the first two years.  The Company's five-year business plan anticipates a total job creation and private investment of 295 jobs and $49.4 million, respectively.","Status1":"Closed","Recipient_M":"LaGrange, Development Authority of","Grant_Amt":850000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Troup","Type_4":"OneGeorgia","Beneficiaries":"ae light metal casting, inc. ","JobsPromised":295,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":46578698,"ActualPrivateInvestment":32000000,"LocalIncentives":6728698,"Public Funds Invested-Actual":7578698,"Closed Date":"4/30/2009","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"Final report cited 50 jobs at the site, which was apparently, the high point of employment. However, in their memos, DCA officials said that the (German-based) company had filed for bankruptcy and had closed down and that there were zero jobs left at the site. Also, the local contribution was divided between the Authority ($4,958,698) and the City of LaGrange ($1,770,000). And, fwiw, company had promised to create hourly jobs at $10.15 to $16.35 an hour and management positions at $15.38 to $55.29 an hour."},{"Serial":4310,"Award_Date":"04/03/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $200,000 in EDGE funds to the Joint Development Authority of Winder-Barrow County (the Authority) to assist in the acquisition of a 49,765 square foot building located on 19.22 acres for a customer service center to locate in Winder, Barrow County.  Chico's FAS, Inc. will create at least 134 new jobs within two years and make a private investment of $10.1 million.  The Winder distribution center will retain 211 jobs created under prior funding and also plans to add 25 new jobs by the end of 2007 due to a department relocation from the Fort Myers facility, which is not part of this project. ","Status1":"Closed","Recipient_M":"Winder-Barrow County, Joint Development Authority of","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Barrow","Type_4":"OneGeorgia","Beneficiaries":"Chico's FAS, Inc. ","JobsPromised":134,"JobsDelivered":115,"MetJobGoal":"N","JobsRetained":211,"ProposedProjectTotal":10356827,"ActualPrivateInvestment":9632096,"LocalIncentives":0,"Public Funds Invested-Actual":200000,"Closed Date":"4/3/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"fell short of jobs and investment but with range 86% jobs and 93% investment; retained all 211 jobs"},{"Serial":4311,"Award_Date":"04/03/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $336,000 in EDGE funds to the Development Authority of Columbus (the Authority) to assist in site preparation for a 25,000 square foot building for a customer service center to locate in Columbus.  Road America will create at least 100 new jobs and make a private investment over a two year period of $4.18 million.","Status1":"Closed","Recipient_M":"Columbus, Development Authority of","Grant_Amt":336000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Road America","JobsPromised":100,"JobsDelivered":181,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":5581960,"ActualPrivateInvestment":4500000,"LocalIncentives":1036000,"Public Funds Invested-Actual":1372000,"Closed Date":"9/29/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"call center for roadside assistance wanted to move out of Hurricane corridor in Miami, staffed 24 hours; exceeded private investement proposed of 4.18 m; local is dev authority and the city for land, 3.73 acres, site prep and sewer reroute"},{"Serial":4314,"Award_Date":"05/16/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $1,000,000 in EDGE funds to the Douglas-Coffee County Industrial Authority (the Authority) to assist in the acquisition of a 53.27-acre tract of land, including an existing 342,475-square-foot building, for a production operation to locate in Douglas.  American Insulated Wire Corporation will create at least 250 new jobs and make a private investment over a two-year period of $16 million.","Status1":"Closed","Recipient_M":"Douglas-Coffee County Industrial Authority","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Coffee","Type_4":"OneGeorgia","Beneficiaries":"American Insulated Wire Corporation","JobsPromised":250,"JobsDelivered":183,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":26550000,"ActualPrivateInvestment":30000000,"LocalIncentives":150000,"Public Funds Invested-Actual":1150000,"Closed Date":"4/1/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":3500,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"actual private investment exceeded proposed of 26,400,000; local was from Coffee County for site prep; property was purchased from Tecumseh Products Co, which moved ops overseas in 2004 resulting in loss of 1,000 Ga. jobs; Ga Tech LOCI analysis showed net present valueof $2.3 m tp Coffee County and $2.76 m to City of Douglas based on 10 year analysis (100 jobs in 2006 growing to 350 jobs in 2009) Recommends project move forward. Note in application on being eligible for JOBS tax credit 3.500 for each eligible fulltime employee (see phone photo)"},{"Serial":4348,"Award_Date":"10/20/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $400,000 in EDGE funds to the Macon-Bibb County Industrial Authority (the Authority) to assist in site preparation to locate a 300,000-square-foot manufacturing facility in Macon.  Nichiha USA will create at least 100 new jobs and make a private investment over a two-year period in excess of $75 million.","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"Nichiha USA","JobsPromised":100,"JobsDelivered":100,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":78256930,"ActualPrivateInvestment":100600878,"LocalIncentives":1651010,"Public Funds Invested-Actual":1969130,"Closed Date":"2/19/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"company is Japan-based fiber cement manufacturer; exceeded private investment goial of $76 m; local is through the authority for land acquisition and infrastructure improvements; anothere $318,120 thru state PSC for gas line"},{"Serial":4358,"Award_Date":"11/21/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $120,000 in EDGE funds to the Downtown Development Authority of the City of Thomasville (the Authority) to assist with building acquisition of three existing structures, along with construction of a new building, to house production, office space and a covered loading dock space in Thomasville, Georgia. International Design and Display Group, LLC will create at least 30 new jobs in 24 months and make a private investment over a two-year period of $1,285,000.","Status1":"Closed","Recipient_M":"Thomasville, Downtown Development Authority of the City ","Grant_Amt":120000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Thomas","Type_4":"OneGeorgia","Beneficiaries":"International Design and Display Group, LLC","JobsPromised":30,"JobsDelivered":17,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":1505000,"ActualPrivateInvestment":1430000,"LocalIncentives":500000,"Public Funds Invested-Actual":620000,"Closed Date":"9/18/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"job goal not met (57 percent) but company exceeded investment goals of$1,285,000. Average of the two 111 plus 57 is 84 %; Local is is ga cities loan and dev authority for construction and renovation"},{"Serial":4360,"Award_Date":"12/06/2006","Description":"The applicant proposes and the Georgia Department of Economic Development recommends, granting $280,000 in EDGE Funds to the Development Authority of the City of Manchester (the Authority) to assist in site development of 21 acres of land to locate G&S Metals in the Manchester Industrial Park. G&S Metals is a producer of high quality, 'recycled primary', aluminum sows and ingot for the casting industry. G&S Metals will create 77 new jobs and will invest $7.5 million.","Status1":"Closed","Recipient_M":"Manchester, Development Authority of the City of","Grant_Amt":280000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Meriwether","Type_4":"OneGeorgia","Beneficiaries":"G&S Metals ","JobsPromised":77,"JobsDelivered":4,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":8065000,"ActualPrivateInvestment":6332129,"LocalIncentives":285000,"Public Funds Invested-Actual":565000,"Closed Date":"1/1/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"company finished building spc building but then filed for bankruptcy June 24,2009. Company suffered a fatal explosion on Nov. 27,2007 from which it never recovered. That combined with the econ downturn; There was a P&A in place but OGA released company from terms due to 'extraoiiordinary circumstances that have occurred' Some e-mail correspondence suggested it was unclear where OGA would rank in terms of recovery, bank foreclosing; "},{"Serial":4388,"Award_Date":"03/09/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $400,000 in EDGE funds to the Crisp County-Cordele Industrial Development Authority (the Authority) to assist in the purchase of a facility in Cordele. Goldens' Foundry and Machine Company will create 100 jobs and invest at least $5 million. The total cost of the project is $8,450,000.","Status1":"Closed","Recipient_M":"Crisp County-Cordele Industrial Development Authority","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Crisp","Type_4":"OneGeorgia","Beneficiaries":"Goldens' Foundry and Machine Company","JobsPromised":100,"JobsDelivered":32,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":8750000,"ActualPrivateInvestment":7500000,"LocalIncentives":975000,"Public Funds Invested-Actual":1475000,"Closed Date":"5/17/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":5250,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"didn't meet job creation but exceeded private investment goal so met overall goal'; company manufactures gray iron and and ductile castings as well aspower  transmission machinery; Comaopny walked away from 975,000 RLP loans and utility bills; company filed for Ch. 11 abbnkruptcy in 2009; taken over by 'This project was not successful for the community as the company walked away fro the local RLF and utility bills'; Taken over by GFMCO; File says eligible for Jobs tax creedit and Ga Port tax credit, maximize jobs tax creit at $5,250 per eligible employee; LOCI sa6s net vale of $976,384 over 5 10 years"},{"Serial":4392,"Award_Date":"04/18/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $800,000 in EDGE Funds to the Grady County Joint Development Authority (Authority) to assist with the costs of infrastructure (sewer & water upgrades) and the purchase of machinery & equipment for a plant expansion in Cairo. The Timken Company will create 168 additional jobs within five years and invest $21 million.","Status1":"Closed","Recipient_M":"Grady County Joint Development Authority","Grant_Amt":800000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Grady","Type_4":"OneGeorgia","Beneficiaries":"The Timken Company ","JobsPromised":168,"JobsDelivered":204,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":14359273,"ActualPrivateInvestment":14359273,"LocalIncentives":10000,"Public Funds Invested-Actual":810000,"Closed Date":"7/18/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":361140,"Co. failed or plant closed":null,"Notes":"Jobs 121.4 % and investment 68.3%. So average is 94.85; Cairo location purchased in 2009 by Koyo Bearings after Timken struggled with financial difficulties; partofassumption agreement was that Koyo meet P&A agreement;eligible for Jobs tax credit worth 4,000 per employee; LOCI predicted 361,140 to City of Cairo over 10 years' local incentiveis cityof cairo administration"},{"Serial":4394,"Award_Date":"04/24/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $500,000 in EDGE funds to the Houston County Development Authority (Authority) to purchase equipment for the expansion of a food processing facility in Perry, Georgia. Perdue Farms will create 375 new jobs in two years and 969 new jobs in five years, in addition to retaining the current 2,175 employees, and make a private investment of $146 million for additional processing equipment, cooking lines and a tem distribution center. The total cost of the project per the EDGE budget is $192,444,000.","Status1":"Closed","Recipient_M":"Houston County Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Houston","Type_4":"OneGeorgia","Beneficiaries":"Perdue Farms, Inc.","JobsPromised":375,"JobsDelivered":310,"MetJobGoal":"N","JobsRetained":2175,"ProposedProjectTotal":126300000,"ActualPrivateInvestment":125800000,"LocalIncentives":0,"Public Funds Invested-Actual":500000,"Closed Date":"6/9/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Succeeded w/85% avg; letter from ecDev said Ga. competing with Alabama, Tenn and SC for expansion project; bought charmaker system used to apply light grill markes for Subway  and progrill systemfor cooking side of operation; authority issued onds opf 177 m in 2005 for expansion projectr"},{"Serial":4397,"Award_Date":"05/17/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $500,000 in EDGE funds to the Adel Industrial Development Authority (the Authority) to assist with pavement repair, lighting installation, land acquisition and building demolition to locate a concrete manufacturing plant in Adel. Xella International will create 100 jobs and make a private investment of $20 million. The total cost of the project is $21 million.","Status1":"Closed","Recipient_M":"Adel Industrial Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Cook","Type_4":"OneGeorgia","Beneficiaries":"Xella International ","JobsPromised":100,"JobsDelivered":55,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":16000000,"ActualPrivateInvestment":19200000,"LocalIncentives":507162,"Public Funds Invested-Actual":1007162,"Closed Date":"5/10/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"In October company said they were closing facility; banks no longer inrerested in supplying capital, hit byrecession; makes aerated autoclaveconcreate used in pods and dorms etc.; large European company; final report stated 92 jobs but at time of site visit it was 52; even with lower emplyees cleared 70%l :ocal is 100,000 for and acquisition abd 400,000 EIP _ funded by locals?_ for rail spur rehab and land acq; said without funding they wuld hve located in Fla.; can claim job tax credit at 4,000 per eligible new full time job; LOCI says 1.8m net benefit to city of adel over 10 years and $425,092 to Cook County"},{"Serial":4398,"Award_Date":"05/17/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $2,025,000 in EDGE funds to the Development Authority of Richmond County (Authority) to purchase telecom equipment for the location of a new data processing center in Augusta. Automatic Data Processing, Inc. (ADP) will create 450 new jobs in thirty-six months and make a private investment of $4.1 million in the first year. The total cost of the project per the EDGE budget is $6,187,800. It is noted that this is the first of four possible grant awards for this project, as the project is broken down by phase. The overall project is expected to create at least 1,000 new jobs, possibly up to 2,000 new jobs, and invest at least $15 million in the state.","Status1":"Closed","Recipient_M":"Richmond County, Development Authority of","Grant_Amt":2025000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Richmond","Type_4":"OneGeorgia","Beneficiaries":"Automatic Data Processing, Inc. (ADP) ","JobsPromised":450,"JobsDelivered":450,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":6187800,"ActualPrivateInvestment":4162800,"LocalIncentives":0,"Public Funds Invested-Actual":2025000,"Closed Date":"3/31/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":4000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"mentions another application for Phase 2 to bring employee total to 1,000; eligible for 4,000 jobs tax credit for eligible employee; LOCI found negative net value of 2.2m over 20 years based on employment of 450. Negative impoact is due to the initial phase of the project with the company leasing the buildimg and not paying propertrty taxes as it will in later phases,  as well as the impact newly created housholds will have on the school system, which will not beoffset by the incomesof those households;  Sep. state level anaylsisfound net annual benefitsof $1 m in first year"},{"Serial":4399,"Award_Date":"05/17/2007","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $100,000 in EDGE Funds to the Thomasville Payroll Development Authority (Authority or Thomasville PDA) to assist in the construction of a 31,000-square-foot manufacturing facility in Thomasville.  Bayly Inc. will create 40 jobs in 24 months and provide a private investment of approximately $2.5 million. Bayly will be relocating from Hollywood, FL, where the company currently has 30 employees with an annual payroll of $750,000. The total cost of the project is $2,595,000.","Status1":"Closed","Recipient_M":"Thomasville Payroll Development Authority","Grant_Amt":100000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Thomas","Type_4":"OneGeorgia","Beneficiaries":"Bayly","JobsPromised":40,"JobsDelivered":23,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":2410000,"ActualPrivateInvestment":2200000,"LocalIncentives":95000,"Public Funds Invested-Actual":195000,"Closed Date":"3/2/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":3000,"LOCI (10 yrs unless noted)":361140,"Co. failed or plant closed":null,"Notes":"manufactures uniform headware or specialty hats for police, fire departments and marching bands; average wage is $10 hr; had 73.5 weighted average; lcal investment is Thomasville PDA for land, legal and grants administration; LOCI 361,140 361,140 net benefit over 10 years; landheld by Tomasville PDA for tax abatement purposes and estimated tax savingsof $103,000; eligible for 3,000 job tax credit per eligible new employee"},{"Serial":4418,"Award_Date":"07/11/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $500,000 in EDGE funds to the Development Authority of Washington County (the Authority) to assist with site preparation for the construction of a manufacturing facility in Washington County. Trojan Battery Company will create 150 jobs in 24 months and make a private investment of $25.5 million. Within 48 months Trojan will create a total of 170 jobs and invest $27 million. The total cost of the project is $34,780,000. ","Status1":"Closed","Recipient_M":"Washington County, Development Authority of","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":162500,"COUNTY":"Washington","Type_4":"OneGeorgia","Beneficiaries":"Trojan Battery Company ","JobsPromised":150,"JobsDelivered":56,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":23830000,"ActualPrivateInvestment":23830000,"LocalIncentives":1212000,"Public Funds Invested-Actual":1005216,"Closed Date":"3/9/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":4000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"manufacturing facility for batteries used by golf cart industry, considering other sites in California, Mexico and Utah; eligile for $4,000 jobs tax credit for each eligile new employee; LOCI net value to Washington County of $1.4 million over 13 years based on employment of 125 in 3 years and city of sandersvile 220,156 over 13 years; local incentives included 5 year tax abatement of 432,000, City of Sandersville contribte$379,500 toward site preop and Washington County 21,000 in prep costs; authority offering one year rent free; recession victim fell short on jobs and investments, company sales are off 20-30 percent in 2008-09; spent 337,500 of EDGE ***Need to check on local incetives actually spent; project had 54% of P&A. No Final REPORT???"},{"Serial":4419,"Award_Date":"07/11/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $200,000 in EDGE funds to the Valdosta Lowndes County Industrial Authority ('VLCIA' or 'Authority') to assist with building acquisition to locate a sprinkler manufacturer in Valdosta.  Roberts Irrigation Products, Inc. ('RIP' or 'Company') has committed to create 44 jobs and make a private investment of $4,350,000 in the first 24 months, increasing to 65 jobs and $5.5 million in five years.","Status1":"Closed","Recipient_M":"Valdosta-Lowndes County Industrial Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lowndes","Type_4":"OneGeorgia","Beneficiaries":"Roberts Irrigation Products, Inc.","JobsPromised":44,"JobsDelivered":44,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":7317143,"ActualPrivateInvestment":7023533,"LocalIncentives":93610,"Public Funds Invested-Actual":293610,"Closed Date":"10/7/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":3000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"sprinkler manufacturer, met job goal and exceeded investment goal 135% average, company was purchased by John Deere soon after EDGE application whioch slowed project down, now called John Deere Water; application mentioned increasing to 65 jobs in five YEARS (2012)' local incentives are VLCIA for land and rail spur extension; eligible for 3,000 per job tax credit for total of$195,000; LOCI shows negative net value of $3,985 for cityof valdosta and $4,444for Lowndes Countyfor combined present value of net benefitsof $459. Secondary benefit of project is reuseof old industrial site"},{"Serial":4424,"Award_Date":"08/22/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $437,000 in EDGE funds to the Development Authority of Bainbridge and Decatur County (the Authority) to assist with infrastructure improvements in the location of a manufacturing facility. Three Rivers Aluminum Company (TRACO) will create 300 jobs within 36 months and make a private investment of $10 million. The total cost of the project is $12,319,604. ","Status1":"Closed","Recipient_M":"Bainbridge and Decatur County, Development Authority of","Grant_Amt":437000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Decatur","Type_4":"OneGeorgia","Beneficiaries":"Three Rivers Aluminum Company (TRACO) ","JobsPromised":300,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":776548,"ActualPrivateInvestment":13000000,"LocalIncentives":1860833,"Public Funds Invested-Actual":2150613,"Closed Date":"4/10/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"Window manufacturer hit by housing downturm; company closed but at one time had 200 jobs; actual public funds invested includes development authority, 1.6 m for building abnd site, GDOT, 71,112 for streets, Decatur County 37.658 for sewer facilities and Decatur County 201,492 for streets etc. $353.507 in money is unspent and recommend deobligation;of edge award228,688 was spent; appears decision was made not clawback becauseof improvements to public infreastryucture andhope to get future tenant "},{"Serial":4429,"Award_Date":"08/31/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $140,000 in EDGE funds to the Macon-Bibb County Industrial Authority (MBCIA or the Authority) to assist with expansion of a cooler/freezer distribution center in Bibb County. MBM will create 100 jobs in 60 months, retain 80 jobs, and make a private investment of approximately $7.7 million. The total cost of the project is $8,224,191. ","Status1":"Closed","Recipient_M":"Macon-Bibb County Industrial Authority","Grant_Amt":140000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Bibb","Type_4":"OneGeorgia","Beneficiaries":"MBM ","JobsPromised":100,"JobsDelivered":42,"MetJobGoal":"N","JobsRetained":80,"ProposedProjectTotal":8224191,"ActualPrivateInvestment":null,"LocalIncentives":798400,"Public Funds Invested-Actual":null,"Closed Date":"9/14/2012","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":3000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Community provides tax abatements of $400,000 plus land vavlued at $398,400 (for total noted under 'local incentives'). State letter says the jobs should be eligible for job tax creditsat $2,500 per job, while Bibb county will additionally provide $500 tax credit per job for a total of $3,000 per job. Report says company exceeded its investment goal ($7.7 million), but I don't have a dollar figure for that actual investment. Also, company fell short of job goal but final report noted that company expected to turn 17 temps into full-time employees, which would bring job total to 59."},{"Serial":4437,"Award_Date":"10/16/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $1,580,000 in EDGE funds to the Development Authority of the City of Jeffersonville and Twiggs County (â€œDAJTCâ€ or â€œAuthorityâ€) to assist with land acquisition and public infrastructure to locate a sporting goods distribution center in Twiggs County.  Academy Sports + Outdoors (â€œAcademyâ€ or â€œCompanyâ€) has committed to create 250 jobs and make a private investment of over $62 million.","Status1":"Closed","Recipient_M":"Jeffersonville and Twiggs County, Development Authority of the City of ","Grant_Amt":1580000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Twiggs","Type_4":"OneGeorgia","Beneficiaries":"Academy Sports + Outdoors","JobsPromised":250,"JobsDelivered":451,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":10125000,"ActualPrivateInvestment":70000000,"LocalIncentives":3221460,"Public Funds Invested-Actual":3604792,"Closed Date":"11/2/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":1900000,"Co. failed or plant closed":null,"Notes":"This was a very succesful project with the company well exceeding its 2 year commitment 0f 250 jobs and 62 million investment, nd being on trackto reach itsproject 5 year job numberof 550 (not an edge project commitment); LOCI found1.9 m net benefit for Twiggs County over 10 years inc prop tax abatements; mentions Jobs tax credit and meterial handling equip[ment sales tax exemption worthpossible 20 million; First industryu to locate in new Twiggs County Industrial Park and likely serve as a catalysut for others to come; local incentives are 500,000 EIP; 383,332 DOT; 711,750 EDA and 429,719 local"},{"Serial":4457,"Award_Date":"12/18/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $1,500,000 in EDGE funds to the Development Authority of Richmond County (Authority) to purchase equipment for the location of a customer-care facility in Augusta, Georgia. T-Mobile will create 700 new jobs in two years and make a private investment of $24 million. ","Status1":"Closed","Recipient_M":"Richmond County, Development Authority of","Grant_Amt":1500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Richmond","Type_4":"OneGeorgia","Beneficiaries":"T-Mobile","JobsPromised":700,"JobsDelivered":705,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":25500000,"ActualPrivateInvestment":23500000,"LocalIncentives":null,"Public Funds Invested-Actual":1500000,"Closed Date":"3/31/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":4000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"is refreshing to see a company perform so well in this climate?' from final report. Beat jobs goal and delivered 23,500,000 of 24 m private investment goal; customer care center; Final report lists no local benefits but application lists a 21 year lease agreement with development authirity allowing 20 years of phasedtax abatments on project equipment at estimated value of 2.6 m; also mentions communityis providing 100,000 in site prep work; jobs should be eligible for jobs tax credit of 4,000per eligible job;  LOCI estimates 388,390 over 20 years (this sounds good but works out to $19,000"},{"Serial":4459,"Award_Date":"01/04/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $150,000 in EDGE funds to the Development Authority of Harris County (â€œAuthorityâ€) to assist with road construction to locate a concrete manufacturer in West Point.  Xpress Materials, LLC (â€œXpressâ€ or â€œCompanyâ€) has committed to create 72 jobs and make a private investment of $10,350,000 in the first 24 months.","Status1":"Closed","Recipient_M":"Harris County, Development Authority of ","Grant_Amt":150000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Harris","Type_4":"OneGeorgia","Beneficiaries":"Xpress Materials, LLC","JobsPromised":72,"JobsDelivered":56,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":13701262,"ActualPrivateInvestment":11340788,"LocalIncentives":3201262,"Public Funds Invested-Actual":3362924,"Closed Date":"4/13/2010","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Hourly jobs to pay $11 to $17 per hour; salaried management positions $50,000 to $65,000 per year. Also note: LOCI analysis showed the biggest benefit to the state/area came from sales taxes and education was the biggest cost.  Community contributed land valued at $450,000, an industrial bond and tax abatements (*BUT* there was no dollar value given to the abatements; they were listed as TBD)."},{"Serial":4463,"Award_Date":"02/07/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $764,000 in EDGE funds to the Barnesville-Lamar County Industrial Development Authority (â€œAuthorityâ€) to assist with land acquisition, site improvements, road construction, and water and sewer extensions for the location of an assembly plant.  General Protecht Group US, Inc. (â€œGeneral Protechtâ€ or â€œCompanyâ€) has committed to create 240 jobs and make a private investment of $30,000,000 in the first 24 months.","Status1":"Closed","Recipient_M":"Barnesville-Lamar County Industrial Development Authority","Grant_Amt":764000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lamar","Type_4":"OneGeorgia","Beneficiaries":"General Protecht Group US, Inc.","JobsPromised":240,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":33614282,"ActualPrivateInvestment":1573200,"LocalIncentives":1283327,"Public Funds Invested-Actual":1712595,"Closed Date":"10/27/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"company makes ground fault circuit interrupters; was hit hard by economy- housing market; state deobligated remaining 334,731.22 in unspent funds; compnay dd not locate to Barnesville; decided not to pursude P&A because compnay not responsive and 'it would likely be very difficult or at leats very costly to pursue legal action' recommend P&A not be pursued. Dev Authority contunued with local improvements on water and sewer inprovements first for GP and then to lure in a new tenant, locals spent 123,327.  Piedmont Green Power has agreed to locatein the Legacy Industrial Park (did they stay??); LOCO [predictednet value over 10 yearsof  3,149,301; average salary would have  been 24,000 a year; "},{"Serial":4479,"Award_Date":"04/10/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $250,000 in EDGE funds to the Development Authority of LaGrange (â€œAuthorityâ€) to assist with the location of an injection molding facility.  DaeLim USA (â€œCompanyâ€) has committed to create 75 jobs and make $11 million in investment within the first 24 months.","Status1":"Closed","Recipient_M":"LaGrange, Development Authority of ","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Troup","Type_4":"OneGeorgia","Beneficiaries":"DaeLim USA","JobsPromised":75,"JobsDelivered":182,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":11629081,"ActualPrivateInvestment":17600000,"LocalIncentives":736216,"Public Funds Invested-Actual":986216,"Closed Date":"4/13/2010","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":3000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Pre-application, state offered a series of things that are not broken out later; unclear if they were delivered (although the total given implies that they were): $82,500 in pre-employment services, $337,500 in services from QuickStart and local technical colleges and a 'discretionary' incentive of $250,000  (which I took to be the EDGE grant). Also, state noted that the company could apply job tax credits of $3,000 per job, valuing said credits at $1,125,000. That pre-application letter from Heidi Green put the state's offer at a value of $1,545,250."},{"Serial":4482,"Award_Date":"05/27/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $200,000 in EDGE funds to the Rockmart Development Authority (â€œAuthorityâ€) to assist with building construction for the expansion of a local aircraft equipment manufacturer in Rockmart.  Engineered Fabrics Corporation (â€œEFCâ€ or â€œCompanyâ€) has committed to create 200 new jobs and to make a private investment of $6 million in the first 24 months.","Status1":"Closed","Recipient_M":"Rockmart Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Polk","Type_4":"OneGeorgia","Beneficiaries":"Engineered Fabrics Corporation","JobsPromised":200,"JobsDelivered":335,"MetJobGoal":"Y","JobsRetained":670,"ProposedProjectTotal":5912227,"ActualPrivateInvestment":6562000,"LocalIncentives":0,"Public Funds Invested-Actual":200000,"Closed Date":"2/14/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"deicing equip for aircraft and helicopter upholstery; no local incentives in final report although application lists 444,794 from Polk County chamber of commerce and dev athority in property tax abatements, waiver of permitting fees and paving for parking lot and drive; also noted $3.6 m in equipment transferred (what happened to these??); Also a 9/20/06 letter from state of georgia lists in job tax credits, varoious tax exemptions, workforce services, job training and tech assistance worth a combined $4.4 million; EDGE cost per job listed at  $1,000 per job but actual cost is much higher.....new facility needed after 37.6 m award from DO to provide fuel cells for military aircraft. Considered moving to Alabama and Florida but stayed in georgia due to incentioves"},{"Serial":4483,"Award_Date":"05/28/2008","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $200,000 in EDGE Funds to the Quitman County Development Authority (Authority) to assist in the construction of a warehouse to expand the manufacturing facility in Georgetown.  D & J Plastics, Inc. (D&J) will create 20 jobs in 24 months and provide a private investment of approximately $200,000.","Status1":"Closed","Recipient_M":"Quitman County Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"D & J Plastics, Inc.","JobsPromised":20,"JobsDelivered":20,"MetJobGoal":"Y","JobsRetained":57,"ProposedProjectTotal":655789,"ActualPrivateInvestment":270155,"LocalIncentives":6000,"Public Funds Invested-Actual":185634,"Closed Date":"8/13/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"manufactures fishing lures, largest private employer in Quitman County and the only exporter in the company;  had a tough time in early 2009; local incebtives include 6,000 from county and 179,634 EIP/GDOT for road construction;"},{"Serial":4484,"Award_Date":"05/28/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $200,000 in EDGE funds to the Griffin-Spalding Development Authority (â€œAuthorityâ€) to assist with land costs for the location of a plastics manufacturing facility. Sumika Polymer Compounds America, Inc. (â€œSPCAâ€ or â€œCompanyâ€) has committed to create 50 jobs and make a private investment of $30,000,000 in the first 24 months.","Status1":"Closed","Recipient_M":"Griffin-Spalding County Development Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Spalding","Type_4":"OneGeorgia","Beneficiaries":"Sumika Polymer Compounds America, Inc.","JobsPromised":50,"JobsDelivered":36,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":30049948,"ActualPrivateInvestment":29555432,"LocalIncentives":294516,"Public Funds Invested-Actual":494516,"Closed Date":"","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Company, a JV of two Tokyo companies with revenues of about $16 billion a year. Proposed creation of 50 jobs avedraging $36,000 a year. Report marked final, but project only 65 percent complete and jobs goal not met."},{"Serial":4501,"Award_Date":"08/21/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $480,000 in EDGE funds to the Development Authority of Burke County (â€œAuthorityâ€) to assist with the location of a manufacturing facility.  ASTA, Inc. (â€œCompanyâ€) has committed to create 100 jobs and make $19 million in investment within the first 24 months.","Status1":"Closed","Recipient_M":"Burke County, Development Authority of","Grant_Amt":480000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Burke","Type_4":"OneGeorgia","Beneficiaries":"ASTA, Inc.","JobsPromised":100,"JobsDelivered":81,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":24882000,"ActualPrivateInvestment":24402000,"LocalIncentives":0,"Public Funds Invested-Actual":480000,"Closed Date":"2/3/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":4000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"makes copper products; being locatedin old Kwikset/Fleetguard facility (see 2003 grant); ASTA says they are having trouble  finding and retainig employees; 'ASTA still faces challenges from skill level development of employees to achieve the required productivity and quality standards'; LOCI found net benefit over 20 years of $574,129 to both city and county based on 71 jobs; 4,000 jobs tax credit per eligibvle employee. Quickstart 789,708 for 100 jobs; Final report makes no mention of local incentives but application notes 1,500 per job created paid to company from community (?) water, sewer and gas lines to site and abatament of city, county and school taxes for 10 years with an option to extend 11-20 years"},{"Serial":4502,"Award_Date":"08/27/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $1,000,000 in EDGE funds to the Valdosta-Lowndes County Industrial Authority (â€œAuthorityâ€) to assist with the location of a distribution center.  The Home Depot, Inc. (â€œCompanyâ€) has committed to create 570 jobs and make $31 million in investment within the first 36 months.  Total project cost is $36,592,287.","Status1":"Closed","Recipient_M":"Valdosta-Lowndes County Industrial Authority","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lowndes","Type_4":"OneGeorgia","Beneficiaries":"Home Depot, Inc.","JobsPromised":570,"JobsDelivered":522,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":39127922,"ActualPrivateInvestment":34934492,"LocalIncentives":5400000,"Public Funds Invested-Actual":6400000,"Closed Date":"12/14/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"local incentives are 500,000 for site prep and 2,693,430 for land both from VLCIA; property tax abatements for 12 years valued at 2,206,570, $12,260 per job with local incentives, that doesnt include Quick Start which estimates 2,568,883 pre and post employment training badsed on 570 employees; wages for associate salary are 11.75 hour"},{"Serial":4503,"Award_Date":"08/27/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $1,000,000 in EDGE funds to the Tift County Development Authority (â€œAuthorityâ€) to assist with the expansion of a manufacturing facility.  Heatcraft Refrigeration Products, LLC (â€œCompanyâ€) has committed to create 325 new jobs and make $22 million in investment within the first 24 months, with a total project cost of $25,492,600.","Status1":"Closed","Recipient_M":"Tift County Development Authority","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Tift","Type_4":"OneGeorgia","Beneficiaries":"Heatcraft Refrigeration Products, LLC","JobsPromised":325,"JobsDelivered":234,"MetJobGoal":"N","JobsRetained":267,"ProposedProjectTotal":25538985,"ActualPrivateInvestment":22000000,"LocalIncentives":2367385,"Public Funds Invested-Actual":3367385,"Closed Date":"12/2/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"expandingoperations, w/out incentives considering move to Mississippi or Mexico; local incebtives include land acquisitionm street improvements, relocate transmission lines and equip relo; jobs fell from FR to close out visit 247 on FR 8/27/10 and 234 on closeout cisit 10/4/10"},{"Serial":4505,"Award_Date":"09/22/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $375,000 in EDGE funds to the Brooks County Development Authority (â€œAuthorityâ€) to assist with the location of an industrial laundry and distribution facility.  Crown Health Care Laundry Services, Inc. (â€œCompanyâ€) has committed to create 140 new jobs and make $4,225,000 in investment within the first 24 months. The total project cost is expected to be at least $4,720,000.","Status1":"Closed","Recipient_M":"Brooks County Development Authority","Grant_Amt":375000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Brooks","Type_4":"OneGeorgia","Beneficiaries":"Crown Health Care Laundry Services, Inc.","JobsPromised":140,"JobsDelivered":120,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":5261458,"ActualPrivateInvestment":4386368,"LocalIncentives":90000,"Public Funds Invested-Actual":965000,"Closed Date":"4/10/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":3000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"healthcare linen and processing company looking to expand operations, local is Quitman naturalgas and sewer improvements; wages 7.50 to 20 per hour; among incentives in 500,000 EIP fund from authority funded through DCA; competed against Florida for project; eligible for JOBS tax credit of 3,000 x 5 years for benefit of$2.1 m in credits which would eliminate the anticipated income tax liability of the company; LOCI run on July 14, 2008 found negative 61,063 over 10 years to cityof Quitman andf negative 57,525 to Brooks County for total negative net of 108,588 to the community; based on facility employment of of 140 annual payroll of $1.9 million and personal property valued at $2.5 m; authority wrote a letter dated July 14,2008 asking to take into consideration the weakened local economy due to closure of manufacturing establishments whichleft a large portion of the residents unemployed"},{"Serial":4508,"Award_Date":"10/15/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $1,425,450 in EDGE funds to the Meriwether County Industrial Development Authority (â€œAuthorityâ€) to assist with the location of an auto supply manufacturing facility.  Dongwon Autopart Technology Georgia, LLC (â€œCompanyâ€) has committed to create 300 jobs and make approximately $23 million in investment within the first 24 months. Total project cost is $28,635,403.","Status1":"Closed","Recipient_M":"Meriwether County Industrial Development Authority","Grant_Amt":1425450,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Meriwether","Type_4":"OneGeorgia","Beneficiaries":"Dongwon Autopart Technology Georgia, LLC","JobsPromised":300,"JobsDelivered":200,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":29580604,"ActualPrivateInvestment":25062154,"LocalIncentives":7909400,"Public Funds Invested-Actual":9334850,"Closed Date":"4/10/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":4000,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"KIA related, manufactures door frames, side impact beams, roof molding side abosorbers and cross bars for KIA facility; note discrpency between application on local incebtives which notes $1,830,000 for road imporvements and $6,079,400 for waste and wastewater improvemnst; FR lists $3,165,605 for local Need to resolve with locals; FR report notes 83 additional jobs were created since previous FR but still lists 200 in sheet; this is a project where they extended the deadline to give them more time for job creatiuob  10/5/11 notes they have met performamve goal of 86 percent 'addl timeis requested to allow for job creation. recomend extending the project to 12/13/2011' and totlas was still 200; mentions prop tax abataments a 100 % through 2012 w/an additiona 15 year phased in prop tax abatement (nodetails); jobs tax credit of 4,000 per eligible job"},{"Serial":4526,"Award_Date":"01/27/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $5,000,000 in EDGE Funds to the Development Authority of LaGrange (Authority) to assist in the location of an auto supply manufacturing facility.  Sewon America, Inc. (Company) will create 550 jobs and provide a private investment of approximately $150 million within 24 months. Total project cost is $161,326,852.","Status1":"Closed","Recipient_M":"LaGrange, Development Authority of","Grant_Amt":5000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Troup","Type_4":"OneGeorgia","Beneficiaries":"Sewon America, Inc.","JobsPromised":550,"JobsDelivered":700,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":182326852,"ActualPrivateInvestment":171000000,"LocalIncentives":6326852,"Public Funds Invested-Actual":11326852,"Closed Date":"4/20/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":19263983,"Co. failed or plant closed":null,"Notes":"largest supplier to KIA automotive; manufactures frame stampings and major chassis components; community investives are more than $16,652,000 inc land for project, infreastructure, improvements to the site, prop tax abatemenys, temp office space, and relocation assistance, Troup county used splost funds; without grant would locate to alabamal wages for production positions pay10.74 to 20.80 an hour; OneGa per job lists$9,091 based on 500 jobs (actually mch more!)LOCI spet. 2, 2008 says $19,263,983 over 10 years to city ans county; lease ter of 12 years with payment of $1 per year (see phone photo for more)"},{"Serial":4532,"Award_Date":"04/03/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $1,200,000 in EDGE Funds to the Development Authority of Harris County (Authority) to assist in the location of an automotive component manufacturing facility.  Daehan Solution Georgia, LLC (Company) will create 300 jobs and make a private investment of approximately $30 million within 24 months. Total project cost is $36,927,000.","Status1":"Closed","Recipient_M":"Harris, Development Authority of ","Grant_Amt":1200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Harris","Type_4":"OneGeorgia","Beneficiaries":"Daehan Solution Georgia, LLC","JobsPromised":300,"JobsDelivered":213,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":35204133,"ActualPrivateInvestment":29062108,"LocalIncentives":4942025,"Public Funds Invested-Actual":6142025,"Closed Date":"12/14/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":1250,"LOCI (10 yrs unless noted)":1793812,"Co. failed or plant closed":null,"Notes":"manufactrures interior automotive components; plans for expansion in 2011 (did it happen?) company met 84% of commitment; Local incentives listed Harris County Board of Commissioners for infrastructure and building; also mentions Jobs tax credits, sales and use tax exemptions, Freeport exemption, ad valrem tax abatement and site acq and prep outlined in March 28, 2008 letter (not found in file and no details)' LOCI Jan. 23, 2008 found 1,793,812 over 10 yuears to Harris County based on employment of 300"},{"Serial":4533,"Award_Date":"04/09/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $2,950,000 in EDGE Funds to the Effingham County Industrial Development Authority (Authority) to assist in the location of a power transformer manufacturing facility.  EFACEC Power Transformers, Inc. (EFACEC or Company) will create 283 jobs and provide a private investment of approximately $60 million within 24 months. By 2016, EFACEC will create a total of 600 jobs and provide an investment of $100 million. Total project cost is $111,867,764.","Status1":"Closed","Recipient_M":"Effingham County, Industrial Development Authority","Grant_Amt":2950000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Effingham","Type_4":"OneGeorgia","Beneficiaries":"EFACEC Power Transformers, Inc.","JobsPromised":283,"JobsDelivered":241,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":81655093,"ActualPrivateInvestment":72846856,"LocalIncentives":5358238,"Public Funds Invested-Actual":8308238,"Closed Date":"8/11/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":1250,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"power transformer manufacturing facility, Portuguese based company; local investment lsightly lower than anticiptated because construction under bjt; competed against SC; jobs pay $15-$33 per hr; Jobs Tax Credit of $1,250 per eligible employee; LOCI dated Dec. 13, 2007 found net benefit of $19,531,514 over 20 years based on 551 jobs; Promised 600 jobs by 2016 (is this happening??); EDGE job total of $10,424 based on 283 jobs"},{"Serial":4536,"Award_Date":"05/13/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $600,000 in EDGE Funds to the West Point Development Authority (Authority) to assist in the location of an auto supply manufacturing facility.  Powertech America, Inc. (Company) will create 355 jobs and provide a private investment of approximately $150 million within 24 months. Total project cost is $153,805,000.","Status1":"Closed","Recipient_M":"West Point Development Authority","Grant_Amt":600000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Troup","Type_4":"OneGeorgia","Beneficiaries":"Powertech America, Inc.","JobsPromised":355,"JobsDelivered":347,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":153805000,"ActualPrivateInvestment":147000000,"LocalIncentives":3205000,"Public Funds Invested-Actual":679275,"Closed Date":"10/5/2011","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"The company is an affiliate of Hyundai, a $74 billion corp. in FY 2008; aimed to serve Kia (which is also a Hyundai affiliate). Local incentive figure includes tax abatements, fee waivers, bond financing and temporary office space. Column under public funds invested includes the $600,000 from OneGeorgia. "},{"Serial":4549,"Award_Date":"10/05/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $1,000,000 in EDGE Funds to the Development Authority of Harris County (Authority) to assist in the location of an auto supply manufacturing facility. Hoover Universal, Inc. (Company) will create 300 jobs and provide a private investment of approximately $30.3 million within 24 months. Total project cost is $35,252,300.","Status1":"Closed","Recipient_M":"Harris County, Development Authority of ","Grant_Amt":1000000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Harris","Type_4":"OneGeorgia","Beneficiaries":"Hoover Universal, Inc.","JobsPromised":300,"JobsDelivered":570,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":64807868,"ActualPrivateInvestment":59700000,"LocalIncentives":4107868,"Public Funds Invested-Actual":5107868,"Closed Date":"12/14/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":1250,"LOCI (10 yrs unless noted)":1321419,"Co. failed or plant closed":null,"Notes":"Kia; will manufacture interior automotive components such as seats and door handles; close out visit notes 700 jobs but sez 109 are temp until after 90 day probationary period; company is a subsidiary of Johnson Controls; community offering land at no cost, property tax abataments, site prep and infrastructure valkued at $5 m; City of West Point, provide water and sewer service, waived permitting fees for 76,000 and temp office space 50,000 and agreed to same tax abatement sked as Harris County; Total tax savings to comoany of $3,345,178 (see 2 phone photos which also show almost no state incime tax liabity for 10 years); $1,250 jobs tax credit; LOCI $1,321,419 benefit to county over 10 years"},{"Serial":4553,"Award_Date":"11/30/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $598,640 in EDGE Funds to the Houston County Development Authority (Authority) to assist in the relocation of Little League Baseball, Inc. (LLB or Company) headquarters to Warner Robins. The relocation will result in creation of 5 jobs and provide a private investment of approximately $3.3 million within 24 months. The total project cost is expected to be at least $5.5 million.","Status1":"Closed","Recipient_M":"Houston County Development Authority","Grant_Amt":598640,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Houston","Type_4":"OneGeorgia","Beneficiaries":"Little League Baseball","JobsPromised":5,"JobsDelivered":6,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":6929640,"ActualPrivateInvestment":4717000,"LocalIncentives":1617000,"Public Funds Invested-Actual":2215640,"Closed Date":"12/15/2011","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"LLB is a nonprofit and moved its SE regional HQ from St. Petersburg Fla. To WR, various tournaments played and exceeded attendance expecttaions with 75,000 spectators; they built 5,000 seat stadium adminstrtaive building nd practice field; local incentives include land acqand site prep also a mention of local cash grant but no details (CK); while only five jobs with an annual payroll of 158,000 there was also an expected benefit from tourism and exposure of the refion through TV coverage, ESPN"},{"Serial":4583,"Award_Date":"03/24/2010","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $300,000 in EDGE Funds to the Development Authority of Houston County (Authority) to assist in the expansion for the Georgia National Guard Joint Cargo Aircraft Training Mission (JCA) at Robins Air Force Base in Warner Robins. The expansion will directly assist L-3 Communications Integrated Systems (â€œL-3â€), who has been contracted by the U.S. Department of Defense to carry out the JCA Training Mission. The expansion will result in creation of 41 jobs and provide a private investment of at least $45 million within 24 months. The total project cost is expected to be $46,839,823.","Status1":"Closed","Recipient_M":"Houston County, Development Authority of","Grant_Amt":300000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Houston","Type_4":"OneGeorgia","Beneficiaries":"Georgia National Guard JCA Training Mission ","JobsPromised":41,"JobsDelivered":33,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":46964005,"ActualPrivateInvestment":46400000,"LocalIncentives":550000,"Public Funds Invested-Actual":848772,"Closed Date":"3/29/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"met obligations with 92% avg; deobligated 1,228 in uused funds; was not able to contact company officials for a final site vist, observed building modifications but unable to take pix because of security concerns; ; L3 Communications is contractor; JCA is Joint Cargo Aircraft Training Mission at Robins AFB; LS contracted by DOD to carry out JCA training mission; The JCA mission transports time-senstive/mission critical cargo to military's various areas of operations around the globe; local incentives arer 125,000 each from Houston County DAuth and City of Warner Robins; 500,000 from Central Georgia Dev Auth No LOCI mentioned EIA (source unknow) sez project would bring in 1,469,177 over 10 yuears of additional sales tax revenue, corp taxes would go elsewhere; L3 has recorded sales in excess of 12 billion for last 4 years; of 33 jobs created 23 were in facility and 10 were maintenance"},{"Serial":4584,"Award_Date":"03/24/2010","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $200,000 in EDGE Funds to the Hart County Industrial Building Authority (â€œAuthorityâ€) to assist in the location of a power transformer manufacturing facility.  Ritz Instrument Transformers, Inc. (â€œRitzâ€ or â€œCompanyâ€) will create 50 jobs and provide a private investment of approximately $3 million within 24 months. Total project cost is $3,471,000.","Status1":"Closed","Recipient_M":"Hart County Industrial Building Authority","Grant_Amt":200000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Hart","Type_4":"OneGeorgia","Beneficiaries":"Ritz Instrument Transformers, Inc.","JobsPromised":50,"JobsDelivered":54,"MetJobGoal":"Y","JobsRetained":50,"ProposedProjectTotal":3471000,"ActualPrivateInvestment":3165617,"LocalIncentives":566229,"Public Funds Invested-Actual":766229,"Closed Date":"9/4/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"local is for site prep and infrastructure from Hart County; German manufcaturer of instrument transformers used in elctrical transmission power systems;  they are making a power transformermanufacturing facility; lease propertt is exempy from ad valorem taxesbut PILOT with Hart county Tax Assessors office; 10 year phase in of ad valoren taxes; study conducted y University of Georgia Carl Vinson Institute of Government found estimatyed about 87 indirect jobs in Hart County which should generate an additionam 4.4 million in personal income tax once manufacturing begins,  The 2010 impact on Hart's economy estimated at nearly $14.7 m; company provided 10 year state projections of $1,245,765; comopany expects to pay no income tax during 10 year period since 95 percent of Ritz's sales arer outside the state and so not subnejt to income tax, ritz  also has a loss carry over (?) from pvs ops in the state;  lease payment of $1,500 a year; "},{"Serial":4588,"Award_Date":"06/16/2010","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $1,500,000 in EDGE Funds to the Development Authority of Columbus, Georgia (â€œAuthorityâ€) to assist in the location of a manufacturing facility. NCR Corporation (â€œCompanyâ€ or â€œNCRâ€) will create 425 jobs and make a private investment of approximately $17.5 million by December 31, 2011. Total project cost is $25,304,700.  NOTE: While the project budget reflects a private investment of $17.5 million, the company has committed to $4 million in the Performance & Accountability Agreement as committed to GDEcD. ","Status1":"Closed","Recipient_M":"Columbus, Georgia, Development Authority of","Grant_Amt":1500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"NCR Corporation","JobsPromised":425,"JobsDelivered":380,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":25304700,"ActualPrivateInvestment":14823048,"LocalIncentives":6304700,"Public Funds Invested-Actual":7804700,"Closed Date":"5/22/2012","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":10772500,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Unclear whether public investment listed includes EDGE's $1.5 million. I don't think it does  and so it's added inâ€¦ a double-check of file does not offer a clear answer. Also: Preliminary lists of incentives from the DEcD shows job tax credits worth $10,272,500 plus JDA tax credits worth $1,467,5000, plus Port Job Tax Credit Bonus worth $3,688,750... plus other tax credits that were available (e.g. Retraining, Child Care, R&D). Unclear how to add all this together under public funds... I don't think they are included in the file's public funds total. Note: Promise of 425 jobs, but NCR provided a jobs 'goal' of 872 that included relocated jobvs from Suwanee facility. Company actually fell short with both investment and jobs, but still met goal, a/t formula goal. Extensive LOCI. Chart of jobs planned, running from 475 technicians ($26K-$38K) through 170 material moving ($22.4K) to 67 professionals ($40,421), 51 engineering jobs ($54,526) and 19 management ($62,350).  QuickStart a big part of the re-lo jobs. Authority bought land and ex-Panasonic building for NCR."},{"Serial":4454,"Award_Date":"11/21/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, awarding $1,005,000 in EDGE funds to the Dodge County/Eastman Development Authority (â€œAuthorityâ€) to assist with machinery and equipment acquisition to help a local company expand its manufacturing operation.  Standard Candy Company (â€œStandardâ€ or â€œCompanyâ€) has committed to create 77 new jobs and make a private investment of at least $1 million.  The EDGE award will be administered as a combination grant-loan; $385,000 will be awarded as a grant and the remaining $620,000 will be awarded as a loan.","Status1":"Conditionally Closed","Recipient_M":"Dodge County/Eastman Development Authority","Grant_Amt":1005000,"Recaptured_Deob":885,"Recaptured_Acct":144043,"COUNTY":"Dodge","Type_4":"OneGeorgia","Beneficiaries":"Standard Candy Company","JobsPromised":77,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":1667402,"ActualPrivateInvestment":null,"LocalIncentives":137245,"Public Funds Invested-Actual":860072,"Closed Date":"6/16/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant  closed":"yes","Notes":"Nashville, Tenn, based company that, most well known product is the Goo-Goo, retolling production to make a new granola product, also makes protein bars. On 6/18/08 site vist they were 34 jobs shy of goal but VP Neil Spradley said they would be picking up in a few months to prepare foir 'diet season' January through March; But suddenly company preparing for Eastman plant closure in April 2009 and moving jobs to Tenn, Ga officials stood form and demanded clawback in Feb. letter; on Feb. 3,2009 letter John J. Jessup, chair of the Eastman-Dofge County Development Authority intervened asking state to grant extension; On April 30,2009 state says agreed upin settlemy amount of $144,043.34 (less than half of that owed); See phone photo on risk analysis; In addition to 77 new jobs 232 existing jobs were to have been retained; local commitment was tax abataments"},{"Serial":4551,"Award_Date":"11/16/2009","Description":"The applicant proposes and the Georgia Department of Economic Development recommends granting $500,000 in EDGE Funds to the Development Authority of Walton County (Authority) to assist in the location of a distribution facility. General Mills Operations, LLC (Company) will create 112 jobs plus 150,000 hours of temp work, and provide a private investment of approximately $42 million within 24 months. Total project cost is $46,718,096.","Status1":"Conditionally Closed","Recipient_M":"Walton County, Development Authority of","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Walton","Type_4":"OneGeorgia","Beneficiaries":"General Mills Operations, LLC","JobsPromised":112,"JobsDelivered":112,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":47970002,"ActualPrivateInvestment":43700000,"LocalIncentives":1598650,"Public Funds Invested-Actual":4270002,"Closed Date":"6/6/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"For distribution facility; Local incentives$2.2 million EDA/EIP/GDOT for water, sewer and rail, walton County and Social Circle for engineering administration and construction, 28,500from DAWC for grant writing and PERS; 1,750 Jobs tax credit for eligible employees;  The state will realize new taxes from the project over the first 10 years in the amount of$1,759,000 in payroll taxes and $3,723,036 in property taxes. No corporate income tax projections were provided, However, it is noted, that the company will likely take advantage of th Job Tax Credit program, which should reduce any Ga, income tyax liability. An IMPLAN analysus was conducted in July 2009 by the University of Georgia Small Business Development Center's Applied Research Division to assess the economic impact of expansion in Walton County, Incorporating direct and multiplier effects, the model estimates over $7 million in total worker income and approximately $14 million in total econ activity from 112 direct and 35.6 indirect jobs projected fir the county."},{"Serial":4602,"Award_Date":"08/03/2010","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, granting $342,743 in EDGE funds to the Okefenokee Area Development Authority (OADA or the Authority) to fund a rail extension for a new fuel pellet manufacturing facility.  Georgia Biomass (or Company) will create 75 new jobs in 24 months and make a private investment of $150 million. The total project cost is $152,236,068.","Status1":"Conditionally Closed","Recipient_M":"Okefenokee Area Development Authority","Grant_Amt":342743,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Ware","Type_4":"OneGeorgia","Beneficiaries":"Georgia Biomass","JobsPromised":80,"JobsDelivered":80,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":132154346,"ActualPrivateInvestment":130000000,"LocalIncentives":1811603,"Public Funds Invested-Actual":2154346,"Closed Date":"2/6/2012","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":1526016,"Co. failed or plant closed":null,"Notes":"rail extension for a new fuel pellet manufacturing facility; Georgia Biomass parent is RWE AG, the No. 1 power porducer in Germany where it is base ,From app: 'This project appears to be an opprtunity to capitalize on ywo of Georgia's major assets: biomass availability and the Savannah port. This is also an opprtunity for Georgia to take a leading position in the growing renewable energy market that is set to take a major presence in the world economy.' See May 12,2011 news release from Deal's office. Ware County applying for EIP grant; low skilled jobs average $13.05 an hour while plant manager$48.08 an hour average wage fore facility is $17.54 an hour; Jobs tax credit 4,000 per eligible employee (including JDA component); compnay's tax projections indicate nogaincome taxes arer due in the first 4 years with $7.3 m due in the last 4 years; Company should be eligible to claim Job Tax Credit in the amount of $1.5 m (75 jobs x $4,000 x 5 years) to offset both income and payrill taxes LOCI analysis by GaTech shows present net value to county over 10 years of $1,526016 based on 80 jobs payroll of about $3 million and property valued ar $130 m;  question of 75 or 80 jobs promised? FR sez 80; local is 1,292,608 for EDA (construction);  county 18,995 for admin and attot fees and 500,000 EIP (construction and engineering);  20 year lease with $1 annual payment and property tax abataments for 10 ytears (see phone photo)"},{"Serial":4257,"Award_Date":"02/23/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $1,205,000 in EDGE funds for the Brooks County Development Authority (the Authority) to help fund the acquisition of an existing facility that will be leased to Micro Craft, Inc. (Micro Craft or the Company) for an expansion of its operations in Brooks County.  Micro Craft has committed to retain 200 jobs, create 175 new full-time jobs, and invest approximately $3 million in the project.    ","Status1":"Deob","Recipient_M":"Brooks County Development Authority","Grant_Amt":1205000,"Recaptured_Deob":1205000,"Recaptured_Acct":null,"COUNTY":"Brooks","Type_4":"OneGeorgia","Beneficiaries":"Micro Craft, Inc. ","JobsPromised":175,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":5670,"ActualPrivateInvestment":0,"LocalIncentives":905000,"Public Funds Invested-Actual":null,"Closed Date":"4/13/2005","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"application filed on Feb. 14, 2005; but on April 19,2005 said theywould not expand in Brooks County. Buildimg not purcgased and funds do not appear to have been drawn down; company attrinuted change of plans to slowing production of GM; instead plan to stay at current Brooks County facility in Quitman; competing against Kentucky"},{"Serial":4262,"Award_Date":"04/05/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $300,000 in EDGE funds for the Development Authority of Columbus (the Authority) to partially fund site preparation costs to help locate Heckler & Koch Defense, Inc. (H & K) in Columbus, Georgia.  H & K is expected to create at least 200 jobs and invest over $25 million initially.  ","Status1":"Deob","Recipient_M":"Columbus, Development Authority of","Grant_Amt":300000,"Recaptured_Deob":300000,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Heckler & Koch Defense, Inc.","JobsPromised":200,"JobsDelivered":15,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":32000000,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":""},{"Serial":4267,"Award_Date":"05/25/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $200,000 in EDGE grant funds for the Athens-Clarke County Industrial Authority ('the Authority' or 'ACCIA'). EDGE funds will be used to assist with the expansion of Oliver Rubber Company's 120,000 square-foot facility in Athens, Georigia. Oliver Rubber Company ('the Company' or 'Oliver Rubber') is a division of Cooper Tire Company, a global company specializing in the design, manufacture and sales of passenger car, light truck, medium truck, motorcycle and racing tires, as well as tread rubber-related equipment for the retread industry. The Company has committed to an investment of $12.8 million, to retain 130 existing jobs and to create an additional 30 new full-time jobs within two years.","Status1":"Deob","Recipient_M":"Athens-Clarke County Industrial Development Authority","Grant_Amt":200000,"Recaptured_Deob":200000,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Oliver Rubber Company","JobsPromised":30,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":13983000,"ActualPrivateInvestment":null,"LocalIncentives":550367,"Public Funds Invested-Actual":null,"Closed Date":"6/7/2006","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Edge funds to be used to partly funds site prep costs to help locate Heckler & Koch Defense in Columbus. A 100k to 150k sf facility to make small firearms for military, law enforcement and private users near Fort. Benning. Competitors per one letter were Virginia, Florida and Texas.  Property to be expandable to 200k sf with a test firing range and offices for the company's US corporate HQ. Of up to $1.8 million in site prep, funds to come from Edge, Authority and H&K. Authority will own project site and lease it to H&K for 20 years. Authority to provide $1.1 million in assistance for site prep. Company and authority commited to the project in writing  per Edge application documents. Authority donating land (unclear if value of land is part of $1.1 million in local commitment). Salary range $23,000 to $77,000. (Edge funds per proposed job $1,500). Project estimated at $3,222,563 in property taxes over 20 years. Promised potentially 500 jobs total, 200 in first two years. Per April 2004 DCA email, groundbreaking took place Oct. 14, 2003. Aug 2004 letter: H&K has a $6 million contract from TSA for Handguns. In '04 got a $26.2 million contract over five years for Homeland Security handguns. Company anticipating long term contract of $1.2 BILLION with DoD for a 'modular weapon system...Edge application said plant to provide $5.4 million in payroll taxes over 10 years and $3.2 million in property taxes over 20 years. ***May 16,2005 report, H&K was awaiting a $1.2 million (could they mean billion?) contract for semi-auto weapons. The contract had not yet been awarded. Company has decided to split project into phases. They leased an authority spec building and started with 20 jobs to start Sept./Oct. 2005. Phase II to come later and when Edge funds to be used.    ***May 26,2005 email from Brian Williamson to Phil Foil: We must point an accountablilty policy in place to help us deal with these situations. Unless the company or local devleopment authoritiy is accountable for performance through (underlined) a legally binding agreement with the state (end underline), these types of issues will continue to occur. Attached are the 'promises' that H&K made prior to receiving their Edge assitance and a copy of our proposed policy. With the current structure, I've frozen the account (non affirmative DCA decision to pay draw-downs) until someone can assess the situation and make a determination of whether we should proceed or not.' ***In a exchange of emails in May 2005, DCA determines that the H&K project will be divided into two phases with Phase II matching the original project proposal. But Phase II is contingent on an award of 'a huge contract.' But DCA said it was not aware of the project being contingent on a DoD project. Per Columbus authority chief Biff Harden, DoD is reviewing a prototype weapon. State memo from Nancy Cobb to Chris Clark states that DCA is trying to get H&K's commitment to the project in writing regardless of DoD contract. Nancy Cobb states: 'I'm not sure if Columbus knew this all along or if HK was 'banking' on the contract and kept it quiet.' Oct. 2007 letter from Columbus to DCA: H&K's contract for an assault weapon with the federal government has been indefinitely delayed. H&K ultimately located a smaller operation in Columbus, acquiring an existing building and operating with 15 employees. "},{"Serial":4271,"Award_Date":"06/06/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $190,000 in EDGE funds for the Heart of Georgia Regional Airport Authority to fund completion of a speculative building to locate an aerospace company. Tower Aerospace Inc. is expected to create 50 new jobs and make a private investment of $4.5 million.    ","Status1":"Deob","Recipient_M":"Heart of Georgia Regional Airport Authority","Grant_Amt":190000,"Recaptured_Deob":190000,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"Tower Aerospace Inc.","JobsPromised":50,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":5418501,"ActualPrivateInvestment":0,"LocalIncentives":728501,"Public Funds Invested-Actual":null,"Closed Date":"3/14/2008","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"funds deobligated; local incentives mostly for rent abatements; company circumstances changed"},{"Serial":4274,"Award_Date":"07/27/2005","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $210,000 in EDGE grant funds for the Athens-Clarke County Industrial Authority ('the Authority' or 'ACCIA'). EDGE funds will be used to assist with the construction of a public road to support the expansion of CertainTeed Corporation in Athens, Georgia. CertainTeed Corporation ('the Company' or 'CertainTeed'), is a manufacturing division of Saint-Gobain Corporation. The Company has committed to a capital investment of $3 million and to create 50 new full-time jobs within two years in addition to its 275 existing jobs.","Status1":"Deob","Recipient_M":"Athens-Clarke County Industrial Development Authority","Grant_Amt":210000,"Recaptured_Deob":210000,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"OneGeorgia","Beneficiaries":"CertainTeed Corporation","JobsPromised":50,"JobsDelivered":35,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":2745225,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"2/19/2009","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Funds deobligated; company was expanding into former levelor facility and is a dvision of Saint Gobain (see their grant separate)  the Athens facility produces fiberglass insulation, it appears that copmpany went ahead and built the road, letter from EcDev says they did not provide required documentation almost 4 yrs after award date"},{"Serial":4313,"Award_Date":"04/26/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $125,000 in EDGE funds to the Development Authority of Emanuel County and the City of Swainsboro (the Authority) to assist in the rehabilitation of an existing 62,000 square-foot building for a manufacturing, warehousing, and distribution operation to locate in Swainsboro.  R & F Marketing will create at least 66 new jobs and make a private investment over a two year period of $1.315 million.","Status1":"Deob","Recipient_M":"Emanuel County and the City of Swainsboro, Development Authority of ","Grant_Amt":125000,"Recaptured_Deob":125000,"Recaptured_Acct":null,"COUNTY":"Emanuel","Type_4":"OneGeorgia","Beneficiaries":"R & F Marketing","JobsPromised":66,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":0,"ProposedProjectTotal":2102500,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"11/3/2006","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"family owned giftware and lamp business; Oct. 3 2006 letter requests deobligation of funds says R and F no longer eligible to receive funds; LOCI had prerdicted 10 year value of net benefits _ present value _ $110,169"},{"Serial":4577,"Award_Date":"02/01/2010","Description":"The applicant proposes, and the Georgia Department of Economic Development (â€œGDEcDâ€) recommends, awarding $180,000 in EDGE loan funds to the Development Authority of Polk County (â€œAuthorityâ€) to assist with the location of a manufacturing facility.  Miura Manufacturing America Co., Ltd. (â€œMiura Boilerâ€ or â€œCompanyâ€) will create 40 jobs and provide a private investment of approximately $11,225,000 within 24 months. Total project cost is $12,385,600.","Status1":"Deob","Recipient_M":"Polk County, Development Authority of","Grant_Amt":180000,"Recaptured_Deob":180000,"Recaptured_Acct":null,"COUNTY":"Polk","Type_4":"OneGeorgia","Beneficiaries":"Miura Manufacturing America Co., Ltd.","JobsPromised":40,"JobsDelivered":56,"MetJobGoal":"Y","JobsRetained":0,"ProposedProjectTotal":12385600,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"9/14/2010","Reporter Initials":"sm","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Edge listed as a loan??Quckstart based on 100 jobs 707,176; state incentive letter lists Quickstart, local and tech colleges support sales and use tax exemptions; job tax credits; engineering and tech assistance and local incentives equal $2,834,123; LOCI 3,411,675 over 10 years to city of Rockmart based payroll of 40; competed against Tenn. appears project went through without edge"},{"Serial":4294,"Award_Date":"02/09/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $150,000 in REBA funds for the Carrollton Payroll Development Authority (the Authority) to fund telecommunications, servers, and equipment for the expansion of an existing company in Carrollton.  Greenway Medical Technologies, Inc. (the Company), has committed to employ 200 people with an average salary over $31,000 and will invest nearly $1 million.","Status1":"Closed","Recipient_M":"Carrollton Payroll Development Authority","Grant_Amt":150000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Carroll","Type_4":"State","Beneficiaries":"Greenway Medical Technologies, Inc. ","JobsPromised":200,"JobsDelivered":214,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":1266116,"ActualPrivateInvestment":4156034,"LocalIncentives":150000,"Public Funds Invested-Actual":300000,"Closed Date":"10/31/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Greenway Medical Technologies and authority saught $150,000 to fund telecom, serivers and equipment for expansion of Greenway, which committed to employ 200 additional people with an average salery of more than $31,000. Private investment commitment of nearly $1 million. Project to require $1.1 million for equipment and $167,000 for upgrades to a commercial office building. Reba and City of Carrollton to provide $150,000 each, respectively, and the company to invest $799,116 plus the buildidng upgrades to a total of more than $960,000. Net public benefit of $756,640. Greenway to receive QuickStart training assistance and jobs tax credits. Unclear amount of tax credits but listed as a Tier 2 community. Net present value of $1.98 million to state over 10 years. ***Audited finances state that Greenway lost $18.4 million in 2004 and $13.5 million 2003. ***Greenway ultimately invested $4,156,034 on the project and hired 214. After application, the company grew out of its leased office space and constructed a building, resulting in increased private investment. "},{"Serial":4308,"Award_Date":"03/14/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $325,000 in REBA funds for the Development Authority of Fulton County ('Authority') to purchase office equipment for an expanding headquarters office in Atlanta.  Following a Company merger with RTM (already headquartered in Atlanta), the Arby's headquarters will be relocated from Florida to Atlanta.  This project will result in the retention of 95 existing jobs in Atlanta, the creation of 90 new jobs in Atlanta, plus the private investment of $4.9 million.","Status1":"Closed","Recipient_M":"Fulton County, Development Authority of","Grant_Amt":325000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Fulton","Type_4":"State","Beneficiaries":"Arby's","JobsPromised":90,"JobsDelivered":null,"MetJobGoal":"","JobsRetained":337,"ProposedProjectTotal":8075000,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"7/27/2010","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Could find no final report with summary of job situation. There is a report from 9/25/2007 that says 337 jobs were retained, but leaves blank the category of jobs created. Jobs include high-paying executivie positions. Cannot tell what the actual private investment is, either.  Arby's headquarters moving from Florida following merger with RTM, company's largest franchisee. "},{"Serial":4332,"Award_Date":"07/10/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $50,000 in REBA funds for the Development Authority of the City of Milledgeville & Baldwin County ('Authority') to assist in the location of a facility for RATH Group.  RATH will create at least 20 new jobs and make a private investment of approximately $10 million.","Status1":"Closed","Recipient_M":"Milledgeville and Baldwin County, Development Authority of the City of","Grant_Amt":50000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Baldwin","Type_4":"State","Beneficiaries":"RATH Group","JobsPromised":20,"JobsDelivered":17,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":8798343,"ActualPrivateInvestment":8624183,"LocalIncentives":124160,"Public Funds Invested-Actual":174160,"Closed Date":"8/10/2007","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"RATH Group, a US subsidiary of a Austrian company, proposes investing $8,798,343 and creating 20 jobs in the Milledgeville area. To lease 41,000 sf in a speculative building. Local authority to provide $124,160 for land and permitting fees plus $50,000 Reba grant.  To have a sales center for refractory products used in Kilns and furnaces. Georgia Tech Loci analysis states that project to provide net benefits of $334,664 for Baldwin County and $116,319 for Milledgeville. Jobs created to pay $10 to $15 per hour, according to application. RATH eligible for job tax credits of potentially $175,000 and will receive property tax abatements over five years totaling $265,357. ***Reporter's math: Company added 17 jobs. If company exercised full tax abatement, all the grants and local contribution and tax credits offered, total public investment and deferral of money was $614,357 or $36,138.65 per job. "},{"Serial":4342,"Award_Date":"08/21/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $750,000 in REBA funds for the Development Authority of Gwinnett County ('Authority') to assist in the location of a facility for Hewlett-Packard Company ('HP').  HP will create at least 60 new jobs and make a private investment of approximately $170 million in the first 24 months of the project.","Status1":"Closed","Recipient_M":"Gwinnett County, Development Authority of","Grant_Amt":750000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Gwinnett","Type_4":"State","Beneficiaries":"Hewlett-Packard Company ","JobsPromised":60,"JobsDelivered":48,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":170750000,"ActualPrivateInvestment":175035345,"LocalIncentives":0,"Public Funds Invested-Actual":750000,"Closed Date":"3/29/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"HP to operate a 360,000 sf facility in Suwanee for a global data center. Projected total (with incentives) of $234,232,000, with $170,175,000 in the first two years including the Reba grant. Reba grant per job (60 new jobs) of $12,500 is proposed. Gwinnett to induce taxable revenue bonds to finance the project. Jobs to pay $60,000 annually on average. LOCI projects the net benefits of $2,174,725 when anticipating a $220 million plus total investment. HP also considering a Fulton site. "},{"Serial":4390,"Award_Date":"03/20/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $500,000 in REBA funds to the Coweta County Development Authority (the Authority) to assist in the plant expansion of a facility in Senoia. Winpak Films Inc. will create 70 new jobs and invest $39 million within two years. The total cost of the project is $41 million. REBA funds are needed to keep the project in Georgia as opposed to the company's home plant in Winnipeg, Canada.","Status1":"Closed","Recipient_M":"Coweta County Development Authority","Grant_Amt":500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Coweta","Type_4":"State","Beneficiaries":"Winpak Films Inc. ","JobsPromised":70,"JobsDelivered":75,"MetJobGoal":"Y","JobsRetained":168,"ProposedProjectTotal":39447000,"ActualPrivateInvestment":27000000,"LocalIncentives":107000,"Public Funds Invested-Actual":850361,"Closed Date":"4/5/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Winpak committed to creating 70 jobs and investing $39 .million. Company ultimately created more jobs, 75 total, and invested less money, $27 million. Direct government funds invested decreased from projected $1,070,000 to $850,361. Per application: Winpak makes packaging materials for food and beverage companies and medical/pharma companies. Reba funds to connect existing Winpak buildings and for improvements. Project originally called for $140,000 for land easement acquisition costs from Senoia, $400,000 in street improvements and $30,000 in grant administration costs provided by authority. Community offered total package (including tax abatement) of $1.9 million. Authority to issue bonds. Company said jobs to pay $34,000 to $74,000 per year. Has 168 jobs existing. Reba grant 'needed to keep the project in Georgia as opposed to the company's home plant in Winnipeg, Canada,' per award letter. Locals offering 50 percent rduction in advalorem taxes on property land and builidings if project financed by  industrial revenue bonds for the life of the bonds (up to 15 years). 100 percent exemption from inventory tax on raw materials, goods in process and finished goods, QuickStart and Labor Department recruiting/screening of new employees, jobs tax credit allowing 50 percent max reduction in state corporate income tax, donation  of 2 acres of land, $400,000 in road improvements. Projected annual payroll of $3,148,000 from the 70 new jobs. Total estimated state assistance,including tax credits and sales tax exemption is $1.1 million , with local estimated services value of $1.9 million. Extension from March 2009 to August 2011 requested as company expected to need time to reach 70 percent or more of commitments. The EIP grant was phased back to meet new phase schedule. Company invested less money after start of work but hired more people ultimately. "},{"Serial":4395,"Award_Date":"04/26/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $100,000 in REBA funds to the Development Authority of Emanuel County and the City of Swainsboro (Authority) to assist in the purchase of machinery and equipment for a plant location in Swainsboro. Vista Window Company (Vista) will create 55 new jobs and invest $1.565 million within two years. The total cost of the project is $1.665 million. REBA funds are needed to keep the project in Georgia as opposed to Jacksonville, Florida.","Status1":"Closed","Recipient_M":"Emanuel County and the City of Swainsboro, Development Authority of","Grant_Amt":100000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Emanuel","Type_4":"State","Beneficiaries":"Vista Window Company ","JobsPromised":55,"JobsDelivered":52,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":1665000,"ActualPrivateInvestment":3157143,"LocalIncentives":0,"Public Funds Invested-Actual":100000,"Closed Date":"3/14/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":4000,"LOCI (10 yrs unless noted)":299943,"Co. failed or plant closed":null,"Notes":"Vista proposes a 56,000 sf facility to make impact-resistant windos for hurricane zones. Competing with Jacksonville, Fla. Will create 55 new jobs, invest $1,565,000  and is asking for $100,000 in reba for machinery and equipment. Locals offering tax abatements for two years on building and equipment for an estimated local incentive of $106,000. Loci benefit analysis of $299,943 over 10 years to Swainsboro. 'Although Vista... is in marginal financial shape the analysis perfomred indicates mostly postiive financial trends.' Salaried jobs to pay $16,000 to $58,000 per year, with hourly jobs to pay $7 to $10.85. Company eligible for a $3,500 job tax credit for each eligible full time job from state, plus a $500 credit per jobs from the local joint develpment authoirity for a total of $4,000 per job. Company actually doubled its investment dollars but did not quite meet job total. Received a score of 148 from the state. "},{"Serial":4417,"Award_Date":"07/11/2007","Description":"The Georgia Department of Economic Development recommends, and the Georgia General Assembly appropriated to DCA through House Bill 1027 (SFY 07) sufficient funding to fulfill the State's 3/16/2006 Agreement with KIA for a $40,500,000 project development grant (in the form of a REBA) to the West Point Development Authority to induce KIA's location in West Point, Georgia. As detailed below, the grant will fulfill Article VII of the Agreement to assist in the purchase of manufacturing facility instruction equipment, parking lots, roads, lighting, fencing, and other costs and expenses for the location of a manufacturing plant in West Point. In consideration of the REBA grant and other considerations, Kia Motors (Kia) committed to create 1,800 new jobs and invest $450 million within two years. The total cost of the project is $635 million. ","Status1":"Closed","Recipient_M":"West Point Development Authority","Grant_Amt":40500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Troup","Type_4":"State","Beneficiaries":"Kia Motors America, Inc","JobsPromised":1800,"JobsDelivered":1752,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":635421000,"ActualPrivateInvestment":450000000,"LocalIncentives":6171000,"Public Funds Invested-Actual":86042500,"Closed Date":"7/10/2007","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":2500,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Job total  reflects employees hired by Kia, plus suppliers on site (Mobis and Glovis). Public funds category does not include $10.3 million in federal funding. State funding category apparently includes $5.7 million in QuickStart as well as a $20.2 million training center built for Kia. Company eligible for job tax credits of $2,500 plus EDA credits of $500 for up to 3,000 jobs. Also, might be eligible for Mega Tax Credit of $5,250 per job. Coompany gets property tax abatements by state, county and city for 16 percent plus partial abatement by Troup Cty. Board of Ed (50 percent for 10 yedars, 25 percent for the next six yeasrs)."},{"Serial":4422,"Award_Date":"08/08/2007","Description":"The Georgia Department of Economic Development recommends, and the Georgia General Assembly appropriated to DCA through House Bill 1027 (SFY 07) sufficient funding to fulfill the State's 3/16/2006 Agreement with KIA for a $46,550,000 project development grant (in the form of a REBA) to the West Point Development Authority to induce KIA's location in West Point, Georgia. As detailed below, $6,050,000 of this grant will fulfill Article V, Section 5.3 of the Agreement to locate a rail spur for the location of a manufacturing plant in West Point. In consideration of the REBA grant and other considerations, Kia Motors (Kia) committed to create 1,800 new jobs and invest $450 million within two years. The total cost of the project is $635 million. ","Status1":"Closed","Recipient_M":"West Point Development Authority","Grant_Amt":6050000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Troup","Type_4":"State","Beneficiaries":"Kia Motors ","JobsPromised":null,"JobsDelivered":null,"MetJobGoal":"","JobsRetained":null,"ProposedProjectTotal":null,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"This is part of the same Kia project, but it was a separate REBA grant to pay for the rail spur. This money was included in that other file's state funding. "},{"Serial":4425,"Award_Date":"08/22/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $300,000 in REBA funds to assist the Development Authority of Douglas County ('Authority') in the location of a new bakery and distribution center in Villa Rica.  Turano Baking Company ('Turano' or 'Company') has committed to make a total private investment of $29 million and to create 100 new jobs.","Status1":"Closed","Recipient_M":"Douglas County, Development Authority of","Grant_Amt":300000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Douglas","Type_4":"State","Beneficiaries":"Turano Baking Company","JobsPromised":100,"JobsDelivered":106,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":32823816,"ActualPrivateInvestment":35000000,"LocalIncentives":null,"Public Funds Invested-Actual":305000,"Closed Date":"1/5/2011","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Public funds total the only ones listed. Company said it might produce 117 to 150 jobs, fell short of that but did beat the commitment number."},{"Serial":4433,"Award_Date":"09/06/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $100,000 in REBA funds to assist the Newton County Industrial Development Authority (â€œAuthorityâ€) in the expansion of a glass manufacturer in Newton County.  Saint-Gobain Desjonqueres North America, Inc. (â€œSGDâ€ or â€œCompanyâ€) has committed to make a total private investment of $3.2 million and to create 31 new jobs in the expansion.","Status1":"Closed","Recipient_M":"Newton County Industrial Development Authority","Grant_Amt":100000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Newton","Type_4":"State","Beneficiaries":"Saint-Gobain Desjonqueres North America, Inc.","JobsPromised":31,"JobsDelivered":32,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":3300000,"ActualPrivateInvestment":3177000,"LocalIncentives":244101,"Public Funds Invested-Actual":344101,"Closed Date":"2/4/2008","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Expansion of Saint-Gobain Desjonqueres North America glass perfume bottle plant. SGD considered Georgia and China for the expansion. GSD plans 3,500 sf expansion of plant and requested a Reba grant of $100,000 for machinery and equipment. Company planned investment of almost $3.2 million. Exxtimated public benefit for first 10 years net Reba is $655,234. Jobs expected to pay $10 to $15 per hour. Community offering $244,101 in local incentives, including electric usage discounts for 2 years, waiver of impact fees and reduction in property fees for one year. "},{"Serial":4456,"Award_Date":"12/13/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $650,000 in REBA funds to assist the Valdosta-Lowndes County Industrial Authority (â€œAuthorityâ€) in the location of a bakery plant in Lowndes County, Georgia.  Martinâ€™s Famous Pastry Shoppe, Inc. (â€œMartinâ€™sâ€ or â€œCompanyâ€) has committed to create 107 jobs and to make a private investment of $40 million within the first 24 months of operation.","Status1":"Closed","Recipient_M":"Valdosta-Lowndes County Industrial Authority","Grant_Amt":650000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Lowndes","Type_4":"State","Beneficiaries":"Martinâ€™s Famous Pastry Shoppe, Inc.","JobsPromised":107,"JobsDelivered":102,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":45096869,"ActualPrivateInvestment":53936243,"LocalIncentives":1871120,"Public Funds Invested-Actual":3021120,"Closed Date":"4/7/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Project Potato. Martin's sought Reba of $650,000. Company proposed hiring 107 at a new plant in Lowndes County. Company proposed spending $42,075,749, with $1,871,120 coming from local authority for land, $650,000 from Reba and $500,000 from federal EIP grant. Considering Georgia and Lake City, Florida. Per application, Valdosta State University LOCI calculated benefits to Lowndes community over 15 years of $204,480, including local incentives and local land, water, sewer and road infrastructure work. After LOCI, EIP grant was awarded reducing local contribution for these items. No state income taxes expected to be generated by the facility. Staff estimated 4.5 percent of 12-year total payroll projections and added three years. Total public benefit for 15 years, net Reba, projected at $2,100,970. Average annual benefit of $140,065. County development authority to help finance through issuance of industrial revenue bonds. County also offering property tax abatements and company eligible for state jobs tax credits and QuickStart assistance. Annual salaries to be $33,529 to $86,552.  According to an April 2007 state letter, tax abatement that has taxes phase back in over time. Offering 'Project Potato' $2,250,813 in tax savings. Unclear on jobs tax credits. From state reports in April 2011: This has been a successful project.' Met 96.6 percent of its commitments.    "},{"Serial":4458,"Award_Date":"12/21/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $1,500,000 in REBA funds to assist the Development Authority of Cobb County (â€œAuthorityâ€) in the acquisition of equipment for the consolidation and location of a global headquarters of a medical research company in Cobb County.  Quintiles Transnational Corporation (â€œQuintilesâ€ or â€œCompanyâ€) has committed that the project will create 400 new jobs by 2011 (in addition to 454 jobs already located in the metro Atlanta area) and generate a total private investment of $17.5 million.","Status1":"Closed","Recipient_M":"Cobb County, Development Authority of ","Grant_Amt":1500000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Cobb","Type_4":"State","Beneficiaries":"Quintiles Transnational Corporation","JobsPromised":400,"JobsDelivered":168,"MetJobGoal":"N","JobsRetained":454,"ProposedProjectTotal":19000000,"ActualPrivateInvestment":55000000,"LocalIncentives":null,"Public Funds Invested-Actual":4250000,"Closed Date":"2/9/2012","Reporter Initials":"mk","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"No formal close date (used final report's acceptance). Also: public funding number is for 'state incentives' not including QuickStart. Consolidation of two sites, plus relocation of headquarters from No. Carolina. Jobs fell short because of slower-than-expected growth, plus recession. Company hired 100 temps, some of whom might be made permanent. "},{"Serial":4480,"Award_Date":"04/18/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $900,000 in REBA funds to assist the Fayette County Development Authority (â€œAuthorityâ€) in the location of an assembly plant in Peachtree City.  Sany America, Inc. (â€œSanyâ€ or â€œCompanyâ€) has committed to create 80 jobs and to make a private investment of $20 million within the first 24 months of operation. The company further commits to create 200 jobs by year five, 350 jobs by year seven, and 600 jobs by year 10, with an investment of $30 million within five years and $50 million by year 10.","Status1":"Closed","Recipient_M":"Fayette County Development Authority","Grant_Amt":900000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Fayette","Type_4":"State","Beneficiaries":"Sany America, Inc.","JobsPromised":80,"JobsDelivered":108,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":30000000,"ActualPrivateInvestment":60699015,"LocalIncentives":3502348,"Public Funds Invested-Actual":1250000,"Closed Date":"4/7/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"** Score card in P&A agreement is $20 million investment. $1.25 million in public funds invested not counting tax abatements. Project extended April 2010 for 24 months as hiring slowed because of recession. Ultimately company surpassed targets. Sany, a Chinese firm, wants to open an assembly plant in Peachtree City. Plan to have 80 jobs in 24 months and invest $20 million. Future plans include up to 200 jobs in five years and up to 600 jobs by year 10 with total investment of $30 million by year five and $50 million by year 10. Considered Sanfrancisco, Vancouver, Portland Oregon, Chicago, and Houston. $900,000 in Reba funds to partially cover land costs for 272 acres. Starting with 2000,000 sf assembly plan expandable to potetnially 600,000 sf with room for a 50,000 sf corporate headquarters and 5,0000 sf R&D center and other buildings. Sany commiteed to invest $28.75 million. Locals will chip in $350,000 for land and $3.15 million for tax abatements over 10 years. LOCI from 2007 said net present value of benefits over 20 years of $4.5 million. !0 years of $1.5 million. Local development authority to issue taxable revenue bonds of up to $30 million for a sale lease back of property. Jobs to range from $30,000 to $90,000 in pay per year. Eligible for $1,250 per job tax credit from state and local JDA (unclear if exercised) and QuickStart for free (estimated $2.3 million value). Estimate of 579 qualifying jobs over time for a projected jobs tax credit of $3.6 million. Estimated $600,000 sales and use tax exemption on machinery. "},{"Serial":4528,"Award_Date":"02/02/2009","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, using $250,000 in REBA funds to assist the Development Authority of Gwinnett County ('Authority') in the location of a solar panel manufacturing facility in Norcross. Suniva, Inc. ('Suniva' or 'Company') has committed to create 150 new jobs and to make a private investment of approximately $69 million within 36 months. Total estimated project cost is $69,968,000.","Status1":"Closed","Recipient_M":"Gwinnett County, Development Authority of","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Gwinnett","Type_4":"State","Beneficiaries":"Suniva, Inc","JobsPromised":150,"JobsDelivered":184,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":69968000,"ActualPrivateInvestment":67031706,"LocalIncentives":5000000,"Public Funds Invested-Actual":250000,"Closed Date":"4/27/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Reba funds of $250,000 to go toward building rehabilitation. Public funds actual starred because not clear if tax abatements fully realized.  Suniva to commit to 150 new jobs, invest $69.7 million in three years. Total projeced cost is $69,9668,000. Suniva, solar panel maker in Norcros, plans to built state of the art photovoltaic cell facility for cost efficient panels. Company borne from the Advanced Techonology Development Center at Georgia Tech. Community is pitching $1.3 million in property tax abatement over 10 years and $4.67 million in five year personal property tax abatement. Suniva is a start up and got $5.5 million in funding from HIG Ventures and New Enterprise Associations (VC firms) in 2007. Additional funding to come from debt and euquity. Company anticipates a loss in firs full year of operation of $5 milllion on sales of $10.6 million. Sunvia epects to sell 76.11 million of its 'wafers' in 2010. Company had cash of $46 million in June 2008 and had a reported six month loss of $1 million. LOCI from Gwinnett County Economic DEvelopment Department projected employment increasing in first ten yars to 627 jobs with personal property investment of $235,892,000 made over first six years. Public benefit for first 16 years projected at $5.5 million. Projected 10 years of state tax collections are $10.9 millio for payroll and $223,963,234 for corporate income taxes.Company eligible for $1,250 per job in jobs tax credits. Average wages of $60,000. Gwinnett Development Authority authorized issuance of up to $235.9 million in revenue bonds for a lease back of the property. . "},{"Serial":4546,"Award_Date":"07/29/2009","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $250,000 in REBA funds for the Development Authority of Fulton County (â€œAuthorityâ€) to purchase office equipment for an expanding headquarters office in Atlanta. Wendyâ€™s/Arbyâ€™s Group, Inc. (â€œWendyâ€™s/Arbyâ€™sâ€ or â€œCompanyâ€) is a result of a merger of Triarc Companies, Inc. (parent company of Arbyâ€™s), already headquartered in Atlanta, and Wendyâ€™s International, Inc., headquartered in Dublin, Ohio. This project will result in the creation of 120 new jobs and private investment of approximately $3.5 million. Total estimated project cost is $3.75 million.","Status1":"Closed","Recipient_M":"Fulton County, Development Authority","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Fulton","Type_4":"State","Beneficiaries":"Wendyâ€™s/Arbyâ€™s Group, Inc.","JobsPromised":120,"JobsDelivered":144,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":3750000,"ActualPrivateInvestment":3406594,"LocalIncentives":null,"Public Funds Invested-Actual":250000,"Closed Date":"3/16/2011","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"**Called Project Redhead. State HQ incentives not spelled out. Must get that.Though company held up its end of job total, not long after close out, Wendys split with Arbys and later moved back to Ohio, taking jobs with them.  ***Merger of Triarc (Arbys) and Wendys International to result in 120 new jobs and investment of $3.5 million. $250,000 to be used for office equipment. Total public benefit estimated at $5.77 million. Estimated payroll of $86,873,963 for 120 jobs (perhaps over 10 years?). Payroll tax of $3.9 million.  Application states the company did not expect to pay state income tax but unclear if that is because to have no income tax liability or if state tax credits would offset liability. Company plans to use HQ tax credit. Employees and families also will get out-of-state tuition waiver from Georgia Regents should they choose to accept. 10 jobs to average $150,000 annually, remainder of first round (83) to average $65,000. Reba dollars per job of $2,083. HQ lease alone to have economic impact of $8.4 million. Reba funds bought things like leather side chairs, 2- $1,178, 37-inch round coffee tables "},{"Serial":4427,"Award_Date":"08/27/2007","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, to use $250,000 in REBA funds to assist the Development Authority of Fulton County (â€œAuthorityâ€) in the headquarters expansion of a Fortune 500 company, Newell Rubbermaid, in Fulton County.  Newell Rubbermaid (â€œNRâ€ or â€œCompanyâ€) has committed to make a total private investment of over $90 million and to create 300 new jobs.","Status1":"Conditionally Closed","Recipient_M":"Development Authority of Fulton County","Grant_Amt":250000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Fulton","Type_4":"State","Beneficiaries":"Newell Rubbermaid","JobsPromised":300,"JobsDelivered":895,"MetJobGoal":"Y","JobsRetained":null,"ProposedProjectTotal":121650000,"ActualPrivateInvestment":185598739,"LocalIncentives":3110220,"Public Funds Invested-Actual":11190220,"Closed Date":"9/21/2010","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Newell Rubbermaid plans a $90 million investment and to create 300 new jobs as part of a headquarters expansion in Sandy Springs. ***A Sept. 2006 document estimated total incentives fo $11.19 million, including $250,000 from REBA, $3,110,220 in local tax abatemnents, $7,500,000 in  HQ tax credit, $330,000 in pre employmnet services and unknown amount of QuickStart assistance. Plan is to consolidate and relocate fucntions of subsidiary headquarters at Two Glenlake Parkway  to be constructed across street from current HQ office. Reba to help fund furniture, fixtures and equipment. Total equipment cost to be $12 million ($250,000 from Reba). Newell Rubbermaid to build a 14 story tower at $90 million. Total investment by company to be $121,400,000 including equipment and lease payments. But Rubbermaid only commiting to $90 million. Expected beneftis to state were $14.2 million over 10 years. NR committed to keeping its distribution center in Columbus and selling a Goody manufacturing building in Manchester Ga to the local development authority at below makret price of 4500,000. Average salary of new jobs $57,000 to $245,000. Industrial revenue bonds to finance construction. "},{"Serial":4239,"Award_Date":"11/09/2004","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $400,000 in REBA funds for the Development Authority of Fulton County (the Authority) to purchase furniture, fixtures, and equipment (FFE) for a corporate headquarters and training center in the Atlanta area.  Newell Rubbermaid has committed to a private investment of $9 million and the creation of 75 full-time jobs, although 24 of the jobs at the Fulton County facility will be filled by Newell Rubbermaid employees already residing in Georgia.","Status1":"Deob","Recipient_M":"Fulton County, Development Authority of","Grant_Amt":400000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Fulton","Type_4":"State","Beneficiaries":"Newell Rubbermaid","JobsPromised":51,"JobsDelivered":51,"MetJobGoal":"Y","JobsRetained":24,"ProposedProjectTotal":9400000,"ActualPrivateInvestment":9000000,"LocalIncentives":0,"Public Funds Invested-Actual":400000,"Closed Date":"9/2/2010","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Newell Rubbermaid intends to put a corporate HQ and training center in Fulton County creating 75 jobs (51 new, 24 retained in state). To relocated to 75,000 sf of office space at Glenlake Parkway. Reba grant of $400,000 to pay for office furniture and communications equipment. Total project cost is $9.4 million, including reba. NR to spend $9 million. Estimated benefits to state of $165,110 over 10 years. Company might qualify for a Corporate HQ tax credit against its withholding tax. Accountant states that company does expect to pay corporate income tax to Georgia so no income tax credits are applicable. The modified public benefit to the state is (negative $272,506). Analysis did not include potential positive impact of local tax revenue or taxes from visitors to the headquarters. Reba per job figure is $5,333 for 75 jobs or $7,483 for just the 51 new proposed jobs. Average compensation $125,000 to $150,000"},{"Serial":4325,"Award_Date":"06/08/2006","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $150,000 in REBA funds for the Atlanta Development Authority ('Authority') to purchase R&D equipment for an R&D facility to locate in Atlanta. Pirelli's headquarters, along with certain research and development facilities, will be relocated from South Carolina to Atlanta.  The R&D project will result in the creation of 30 new jobs and private investment of $2 million.","Status1":"Deob","Recipient_M":"Atlanta Development Authority ","Grant_Amt":150000,"Recaptured_Deob":null,"Recaptured_Acct":null,"COUNTY":"Fulton","Type_4":"State","Beneficiaries":"Pirelli North America, Inc.","JobsPromised":30,"JobsDelivered":null,"MetJobGoal":"","JobsRetained":null,"ProposedProjectTotal":2900000,"ActualPrivateInvestment":null,"LocalIncentives":0,"Public Funds Invested-Actual":900000,"Closed Date":"?","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"***Partial Deobligation on 8/15/2012. No final report. No reporting of jobs created or private investment. Unclear if full public investment (minus $15,000 deobligation was actually spent.) Pirelli to relocate a R&D center in Atlanta and create 30 jobs. Relo HQ and R&D from South Carolina. Competition is South Carolina. **this could be a part 1 of 2 file.** $150,000 in Reba funds for equipment for R&D center. Proposed private investment of $2 million, per application. Appears to be fore broadband communications. Check Gov. Perdue Press Release.  Center to be housed at Georgia Electronic Design Center at Tech Square (Georgia Tech, 75 Fifth St). Total project cost estimated at $2.9 million, per application, including $750,000 in funding from Georgia Research Alliance. Estimated 10-year benefit to community of $1,427,394. Proposal got a low score of 55 for feasibility, with request form stating the requestion did not include 'sufficient documentation for the project to support a higher score... The applicant as submitted was severely lacking in required documentation.' Funds for equipment, but not equipment list or invoices supplied. Jobs to have an average salary of $90,000. "},{"Serial":4504,"Award_Date":"09/08/2008","Description":"The applicant proposes, and the Georgia Department of Economic Development recommends, granting $200,000 in REBA funds to the Athens-Clarke County Industrial Development Authority (the Authority) to assist in providing road access for a plant expansion of a facility in Athens. SKAPS Industries (SKAPS) will create 130 new jobs and invest $12 million within two years. The total cost of the project is $22 million.","Status1":"Deob","Recipient_M":"Athens-Clarke County Industrial Development Authority","Grant_Amt":200000,"Recaptured_Deob":200000,"Recaptured_Acct":null,"COUNTY":"Multi-County","Type_4":"State","Beneficiaries":"SKAPS Industries","JobsPromised":130,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":null,"ProposedProjectTotal":23968984,"ActualPrivateInvestment":null,"LocalIncentives":null,"Public Funds Invested-Actual":null,"Closed Date":"11/26/2012","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"Deobligated: Project never took place. No explanation given for why it did not happen. Funds withdrawn never spent.*** SKAPS had sought $200,000 in Reba for road access imporvements for plant expansion. Proposal was for 130 jobs and $12 million private investment. SKAPS produces fabric for landfill lining and erosion control and packing for produce and other farm poducts. Proposed local incentives of $1,718,984 for tax abatements on building and machinery. Proposed private investment of $22,250,000 for expansion of their existing facility by 180,000 sf in an adjacent structure. Local development authority issued $17 million in bonds and is doing a sale lease back on the building for a 20 year term to pay off the bonds. Jobs to be $20,800 to $31,054 per year. Company qualifies for up to $3,500 in jobs tax credits for being in a less developed census tract area of Clarke County. Competition for jobs is South Carolina and India. "},{"Serial":4660,"Award_Date":"07/06/2011","Description":"The applicant proposes, and the Georgia Department of Economic Development (GDEcD) recommends, using $500,000 in REBA funds for the Development Authority of DeKalb County (â€œAuthorityâ€) to purchase equipment for the relocation and expansion of a gaming company. CCP North America, Inc. (â€œCCPNAâ€ or â€œCompanyâ€) will create 150 new jobs, retain 156 existing jobs, and provide a private investment of approximately $1.5 million by March 31, 2015. Total estimated project cost is $2 million.","Status1":"Deob","Recipient_M":"DeKalb County, Development Authority of","Grant_Amt":500000,"Recaptured_Deob":500000,"Recaptured_Acct":null,"COUNTY":"DeKalb","Type_4":"State","Beneficiaries":"CCP North America, Inc. ","JobsPromised":150,"JobsDelivered":0,"MetJobGoal":"N","JobsRetained":156,"ProposedProjectTotal":2000000,"ActualPrivateInvestment":null,"LocalIncentives":139750,"Public Funds Invested-Actual":null,"Closed Date":"8/23/2011**","Reporter Initials":"jst","JOBS Tax Credit-Eligible per employee":null,"LOCI (10 yrs unless noted)":null,"Co. failed or plant closed":null,"Notes":"**Deobligated: Transferred as a $1 million Reba grant to City of Decatur's DDA by amendment of agreement. That file appears to still be open. The $1 million contingent on creating 150 jobs in phase 1 and 150 in phase 2. Originally Reba $500,000 for the DA of DeKalb County to purchase equipment for relo and expansion of CCP North America , a gaming company. Company proposed $1.4 million in proivate invesmtne by March 2014. Would create 150 new jobs and retain 156 existing jobs. Company planned to move operations from Gwinnett to Decatur and create 150 new positions in phase 1 and possibly another 150 in phase 2. Plans to request additional $500,000 if phase 1 successful. CCP plans to lease Wells Fargo building in Decatur (3 floors) grant for office furniture and IT equipment. Community offering bond financing and property tax abatements (never used). Company's game are a multiplayer web basd game called EVE and also make games for PSP, PlayStation 3 and other consoles and smartphones. LOCI predicts net present value of net benefits of $122,673 to city and $1,553,283 to DeKalb. LOCI assumed creation of 495 jobs over 10 years with payroll of $28.3 million in year 10. Company expects no payroll tax liabilities on its expected $29.18 million in payroll (year 2020) because of Georgia Entertainment Industry Investment Act tax credits. Predicted 10 estimates for Film and Entertainment tax credit and state research tax credit of $81.6 million. Company said average pay of new jobs to be $63,000 and require bachelors degree or more. "}]